{"topic":{"0":"business","1":"business","2":"business","3":"business","4":"business","5":"business","6":"business","7":"business","8":"business","9":"business","10":"business","11":"business","12":"business","13":"business","14":"business","15":"business","16":"business","17":"business","18":"business","19":"business","20":"business","21":"business","22":"business","23":"business","24":"sports","25":"sports","26":"sports","27":"sports","28":"sports","29":"sports","30":"sports","31":"sports","32":"sports","33":"sports","34":"sports","35":"sports","36":"sports","37":"sports","38":"sports","39":"sports","40":"sports","41":"sports","42":"sports","43":"sports","44":"sports","45":"sports","46":"sports","47":"sports","48":"sports","49":"technology","50":"technology","51":"technology","52":"technology","53":"technology","54":"technology","55":"technology","56":"technology","57":"technology","58":"technology","59":"technology","60":"technology","61":"technology","62":"technology","63":"technology","64":"technology","65":"technology","66":"technology","67":"technology","68":"technology","69":"technology","70":"technology","71":"technology","72":"technology","73":"entertainment","74":"entertainment","75":"entertainment","76":"entertainment","77":"entertainment","78":"entertainment","79":"entertainment","80":"entertainment","81":"entertainment","82":"entertainment","83":"entertainment","84":"entertainment","85":"entertainment","86":"entertainment","87":"entertainment","88":"entertainment","89":"entertainment","90":"entertainment","91":"entertainment","92":"entertainment","93":"entertainment","94":"entertainment","95":"entertainment","96":"entertainment","97":"entertainment"},"title":{"0":"Father said 'if you want to blow money up, fine' as I put $250M on vaccine: Adar","1":"Ambani's RIL to invest up to $50 mn in Bill Gates' Breakthrough Energy Ventures","2":"Special Indian version of PUBG Mobile to be launched, announces developer","3":"China's Alibaba records $74 billion sales in 11-day Singles' Day sale","4":"Retail inflation in October rises to 7.61%, highest in over 6 years","5":"Moody's revises India's 2020 GDP forecast to -8.9% from -9.6%","6":"India likely entered recession for first time ever in FY21 first half: RBI","7":"Existing ₹3 lakh crore ECLGS extended till March 2021","8":"Sitharaman announces some income tax relief for homebuyers and developers","9":"India seeing strong recovery, Composite PMI at highest in 9 years: FM","10":"Pfizer CEO sold shares worth ₹41 cr on same day as company's vaccine news","11":"Employees working from home should be taxed to help those who can't: Deutsche","12":"Atmanirbhar Bharat Rozgar Yojana launched to incentivise job creation by firms","13":"NPCI to moderate onboarding of users if apps reach 30% UPI cap: Report","14":"Singapore launches special work visa for technology executives ","15":"It reflects govt's commitment to Make in India: COAI chief on PLI scheme","16":"Iran says it exports 7L bpd of oil, later denies amid US sanctions","17":"Rana Kapoor's daughter granted bail in Yes Bank fraud case","18":"MM Murugappan steps down as chairman of 3 Murugappa Group firms","19":"FM Sitharaman announces ₹65,000 cr fertiliser subsidy for farmers","20":"GST fraud of over ₹400 crore unearthed in Mumbai, 4 arrested","21":"Blackstone to buy Piramal's glass unit for $1 billion: Reports","22":"Amazon not shareholder, no say in our affairs: Future Retail to Delhi HC","23":"Provided total stimulus package of ₹29.87 lakh cr or 15% of GDP: FM","24":"Aakash Chopra names his best IPL 2020 XI, includes 3 players yet to make int'l debut","25":"Suryakumar Yadav is the Indian AB de Villiers: Harbhajan Singh","26":"Nasser Hussain names his Team of IPL 2020, includes six Indians","27":"Juhi criticises authorities for poor arrangement at airport after returning from UAE","28":"There are two different versions of Virat Kohli, saw it first-hand: Adam Zampa","29":"BCCI will leave no stone unturned to deliver a safe T20 World Cup in 2021: Jay Shah","30":"Tim Paine throws away his gloves in frustration after being given out LBW","31":"Ravi Shastri shares pic with Team India support staff wearing customised PPE kits","32":"WI batsman joins Pakistan Super League team wearing MI jacket and mask, pic surfaces","33":"Krunal stopped at Mumbai airport over suspicion of carrying undisclosed gold: Reports","34":"Dhoni to farm Kadaknath chicken in his Ranchi farmhouse, orders 2,000 chicks from MP","35":"Croatia defender Domagoj Vida pulled from match at halftime because of COVID-19","36":"Younis Khan appointed Pakistan batting coach till 2022 T20 World Cup","37":"I can't express the feeling: Kapil Dev shares video playing golf after heart surgery","38":"India pacer Natarajan completes vow by shaving off his beard after daughter's birth","39":"Our on-field discipline won us IPL 2020: MI captain Rohit Sharma","40":"DC will dominate IPL for next few years like CSK had done: Irfan Pathan","41":"Thank all the players for making IPL 2020 possible: Ganguly","42":"Virat won't take chance against me, matter of pride for him: Ashwin","43":"Despite our ups and downs, DC always showed fighting spirit: Pant","44":"Will come up with measures to allow foreign spectators: Tokyo Olympic CEO","45":"Pakistan's Shoaib Malik and Mohammad Amir not selected for NZ tour","46":"Virat's absence doesn't mean series win for Australia: Nathan Lyon","47":"Australia announce 17-member squad for Test series against India","48":"Maradona released from hospital 8 days after brain surgery","49":"Dyson air purifiers aim to beat pollution and keep you warm","50":"YouTube down for users worldwide for over an hour, issues now fixed","51":"Ambani's RIL to invest up to $50 mn in Bill Gates' Breakthrough Energy Ventures","52":"Special Indian version of PUBG Mobile to be launched, announces developer","53":"Google Photos to end free unlimited storage on June 1, 2021","54":"'Mickey Mouse', 'Donald Duck' summoned to UK court due to testing error","55":"Facebook extends ban on US political ads for another month","56":"Snap buys Israeli voice tech startup Voca.ai for $70 mn: Reports","57":"Germany to probe messaging apps for violating consumer protection law","58":"Engineers hack EV charging to show cybersecurity vulnerabilities","59":"US Treasury seeks resolution of security risks with TikTok parent ByteDance","60":"Singapore launches special work visa for technology executives ","61":"Users allege WHO censored 'Taiwan' under its live-stream on Facebook","62":"Facebook profiting off hate: Ex-employee tells Delhi Assembly panel","63":"Tech problems in England's test-and-trace caused delays up to 48 hrs","64":"Twitter to launch feature that filters graphic media in DMs: Reports","65":"NPCI to moderate onboarding of users if apps reach 30% UPI cap: Report","66":"WHO cites cybersecurity reason for censoring 'Taiwan' on Facebook","67":"Yelp, Trivago, 163 others call for antitrust action against Google","68":"Centre issues notice to Twitter for showing Leh as part of J&K","69":"It reflects govt's commitment to Make in India: COAI chief on PLI scheme","70":"UN Rapporteur calls for moratorium on use of tech in border enforcement","71":"Air taxi startup Lilium to set up first US hub in Florida","72":"Dutch university students develop electric car from recycled waste material","73":"53-yr-old actor Asif Basra found hanging at a private complex in Himachal","74":"I cast Asif Basra in Jab We Met as I wanted an intelligent actor: Imtiaz Ali","75":"American singer sings 'Om Jai Jagdish Hare' for Diwali, releases video","76":"Milind shares old pics from 2012, reveals he ran 1,500 km in 30 days","77":"Too shocking, shot with him just before lockdown: Manoj on Asif Basra's death","78":"Acting a high-risk profession, almost like working in a hospital: Saif Ali Khan","79":"Balika Vadhu actress Avika Gor confirms relationship with ex-Roadies contestant","80":"Kangana's brother Aksht gets married in Udaipur, actress shares 1st pics","81":"I know you're with me: Neetu remembers Rishi as she leaves for a shoot","82":"Film set is a very dangerous environment amid COVID-19: Saif","83":"We were blessed to have Zeeshan Ayyub in 'Chhalaang': Rajkummar","84":"I wish to be directed by Vishal Bhardwaj: Pak actor Bilal","85":"Turned to production as I wasn't getting good acting offers: Nikhil","86":"We've currently decided to concentrate on work: Pulkit on marriage with Kriti","87":"Dhanush to play role of Rajinikanth in veteran actor's biopic: Reports","88":"Arjun Rampal's girlfriend arrives at NCB office for 2nd consecutive day","89":"I evolved a lot: Sharad on playing a transgender in 'Laxmii'","90":"Britney won't resume career as long as her father is involved: Lawyer","91":"Madhya Pradesh HC refuses to quash FIR against Ekta Kapoor","92":"Anyone bursting crackers this year is doing disservice to society: Swara","93":"Pulkit Samrat has taught me to be a secure actor: Kriti Kharbanda","94":"People didn't think once before abusing my parents: Himansh Kohli","95":"It feels unreal: Shilpa Shetty on completing 27 yrs in B'wood","96":"This is hard to digest: Divya Dutta after Asif Basra's death","97":"Arjun Rampal summoned by NCB on November 13"},"author":{"0":"Pragya Swastik","1":"Pragya Swastik","2":"Krishna Veera Vanamali","3":"Pragya Swastik","4":"Pragya Swastik","5":"Rishabh Bhatnagar","6":"Krishna Veera Vanamali","7":"Rishabh Bhatnagar","8":"Krishna Veera Vanamali","9":"Krishna Veera Vanamali","10":"Krishna Veera Vanamali","11":"Krishna Veera Vanamali","12":"Krishna Veera Vanamali","13":"Hiral Goyal","14":"Rishabh Bhatnagar","15":"Hiral Goyal","16":"Rishabh Bhatnagar","17":"Kiran Khatri","18":"Kiran Khatri","19":"Kiran Khatri","20":"Rishabh Bhatnagar","21":"Rishabh Bhatnagar","22":"Kiran Khatri","23":"Kiran Khatri","24":"Anmol Sharma","25":"Anmol Sharma","26":"Anmol Sharma","27":"Anmol Sharma","28":"Anmol Sharma","29":"Anmol Sharma","30":"Anmol Sharma","31":"Anmol Sharma","32":"Anmol Sharma","33":"Anmol Sharma","34":"Anmol Sharma","35":"Anmol Sharma","36":"Sumit Josh","37":"Anmol Sharma","38":"Anmol Sharma","39":"Sumit Josh","40":"Sumit Josh","41":"Sumit Josh","42":"Sumit Josh","43":"Sumit Josh","44":"Sumit Josh","45":"Sumit Josh","46":"Sumit Josh","47":"Sumit Josh","48":"Sumit Josh","49":"Roshan Gupta","50":"Daisy Mowke","51":"Pragya Swastik","52":"Krishna Veera Vanamali","53":"Krishna Veera Vanamali","54":"Pragya Swastik","55":"Hiral Goyal","56":"Rishabh Bhatnagar","57":"Hiral Goyal","58":"Aishwarya Awasthi","59":"Hiral Goyal","60":"Rishabh Bhatnagar","61":"Hiral Goyal","62":"Hiral Goyal","63":"Hiral Goyal","64":"Rishabh Bhatnagar","65":"Hiral Goyal","66":"Hiral Goyal","67":"Rishabh Bhatnagar","68":"Hiral Goyal","69":"Hiral Goyal","70":"Hiral Goyal","71":"Hiral Goyal","72":"Hiral Goyal","73":"Pragya Swastik","74":"Anmol Sharma","75":"Daisy Mowke","76":"Daisy Mowke","77":"Pragya Swastik","78":"Pragya Swastik","79":"Daisy Mowke","80":"Daisy Mowke","81":"Udit Gupta","82":"Udit Gupta","83":"Udit Gupta","84":"Udit Gupta","85":"Udit Gupta","86":"Udit Gupta","87":"Udit Gupta","88":"Atul Mishra","89":"Udit Gupta","90":"Atul Mishra","91":"Atul Mishra","92":"Udit Gupta","93":"Atul Mishra","94":"Atul Mishra","95":"Udit Gupta","96":"Udit Gupta","97":"Udit Gupta"},"content":{"0":"Serum Institute of India's (SII) CEO Adar Poonawalla revealed that his father Cyrus S Poonawalla told him, \"Look, it's your money. If you want to blow it up, fine,\" as he put $250 million in ramping up COVID-19 vaccine manufacturing capacity. Adar told The Washington Post, \"I decided to go all out.\" His father founded SII in 1966.","1":"India's richest man Mukesh Ambani's RIL has announced an investment of up to $50 million in US-based coalition Breakthrough Energy's clean energy fund, Breakthrough Energy Ventures. Founded by world's second-richest man Bill Gates, Breakthrough Energy is a group of HNIs to fund clean energy companies. The $50 million investment constitutes 5.75% of the size of the fund contemplated at present.","2":"South Korea's PUBG Corporation on Thursday announced that it is preparing to launch 'PUBG Mobile India', which has been specially created for India.  Additionally, the company said it plans to make investments worth $100 million in India. It will also create an Indian subsidiary which will hire over 100 employees specialising in business, esports and game development. ","3":"Chinese billionaire Jack Ma's Alibaba on Thursday announced it recorded $74.1 billion in sales during its 11-day Singles' Day sales amid COVID-19. It brought sellers on Alibaba 21 times as many orders by value as Amazon's two-day global Prime Day last month. Singles' Day, observed on November 11 in China, is a holiday that celebrates people who aren't in relationships. ","4":"The country's retail inflation, measured by the Consumer Price Index (CPI), stood at 7.61% in the month of October compared to 7.27% in September, government data showed on Thursday. The 7.61% figure for retail inflation is the highest since May 2014 as prices of vegetables and pulses soared. Inflation in food and beverages rose to 10.16% in October.","5":"Global ratings agency Moody's revised India's GDP growth forecast for calendar year (CY) 2020 to a -8.9% contraction from its earlier estimate of a -9.6% contraction. Finance Minister Nirmala Sitharaman today cited the revision as a sign of economic recovery. Moody's also revised the GDP forecast for CY21 upwards to 8.6% from 8.1% projected earlier.","6":"India's economy is likely to have entered a technical recession (two successive quarters of GDP contraction) for the first time in its history in the first half of 2020-21, the RBI said. The central bank's nowcasting model suggested that India's GDP likely contracted by 8.6% in the July-September quarter after a contraction of 23.9% in the April-June quarter.","7":"Finance Minister Nirmala Sitharaman has extended the existing ₹3 lakh crore Emergency Credit Line Guarantee Scheme (ECLGS) to March 31, 2021 as part of Atmanirbhar Bharat 3.0. The fully guaranteed, collateral-free scheme offers additional credit up to 20% of outstanding loans. Credit guarantee support will now be provided to 26 stressed sectors identified by Kamath Committee plus healthcare.","8":"To provide income tax relief to homebuyers and developers, Finance Minister Nirmala Sitharaman has allowed a 20% differential between the circle rate and agreement value under Section 43CA of Income Tax Act. This would be applicable only on primary sale of residential units worth up to ₹2 crore till June 30, 2021. Till now, a differential of 10% was allowed.","9":"Finance Minister Nirmala Sitharaman on Thursday said that a strong recovery can be seen in the economy with Composite Purchase Managers Index rising to its highest in nearly nine years. Energy consumption, GST collections all showing healthy trends, Sitharaman said. She added that credit has improved and FDI inflows have risen.","10":"Pfizer CEO Albert Bourla sold 62% of his stock in the company worth $5.56 million (₹41.4 crore) on the same day the US drugmaker reported positive data on its COVID-19 vaccine. He sold the shares at close to their highest price this year. The sale happened as Pfizer's shares hit a certain price as part of a pre-announced trading plan.","11":"Employees who are working from home should be charged a 'privilege' tax, with the proceeds used to help lower-paid and essential workers who can't work remotely, Deutsche Bank suggested. A 5% work-from-home tax could raise $48 billion in US and $23.6 billion in Germany, it said. The virus has benefitted those who can do their jobs virtually, the bank added.","12":"Finance Minister Nirmala Sithamaran on Thursday launched the Atmanirbhar Bharat Rozgar Yojana to incentivise job creation during the COVID-19 recovery phase. This is eligible for EPFO-registered companies hiring workers at monthly wages less than ₹15,000. For firms with up to 1000 employees, the government will pay employee’s and employer’s contribution to EPF of 12% each for two years.","13":"The National Payments Corporation of India (NPCI) could moderate the onboarding of new users to enforce its 30% cap on the total volume of UPI transactions through third-party apps, ET reported. It could also mandate banks operating as payment service providers to third-party apps such as Google Pay to monitor their market share and report to NPCI, the report added.","14":"Singapore has announced a work visa called Tech.Pass for technology firms executives. Under the programme launching in January, up to 500 executives can apply for two-year visas which will allow them to operate a business, invest in or become a director in Singapore-based companies, and mentor startups. Employees with previous monthly salary of $20,000 and five years' experience can apply.","15":"The Director General of Cellular Operators Association of India (COAI) SP Kochhar said that the PLI scheme reflects the government's commitment towards the 'Make in India' initiative. The telecom industry has been \"extremely resilient\" during COVID-19 pandemic and played a pivotal role in supporting other sectors, he added. The PLI scheme outlays ₹12,195 crore for telecom and networking products.","16":"Iran's budget and planning organisation's deputy head Hamid Pourmohammadi said the country's average oil sales this year have been 6,00,000-7,00,000 barrels per day (bpd), a figure that is not revealed by the country currently facing US sanctions. Later in the day, he withdrew his comments and said the figure was Iran's exports plan for next year.","17":"A magistrate court has granted bail to Yes Bank Founder Rana Kapoor's daughter Roshni Kapoor, an accused in the fraud case linked to Dewan Housing Finance (DHFL). Roshni, who is one of the eight accused, was summoned by the court last month in the case. The CBI had alleged that Yes Bank invested ₹3,700 crore in short-term debentures in DHFL.","18":"MM Murugappan has stepped down as the chairman and director of three listed companies of the ₹38,105-crore Murugappa Group as he turned 65 years old. The board of directors of Cholamandalam Investment and Finance Company (Chola) elected Vellayan Subbiah as the Chairman with effect from November 12. Coromandel International's board of directors elected A Vellayan as their Chairman.","19":"Finance Minister Nirmala Sitharaman on Thursday announced a ₹65,000 crore fertiliser subsidy for farmers as part of the new ₹2.65 lakh crore stimulus package. The subsidy is being provided to ensure adequate availability and timely accessibility of fertilisers to farmers, the FM said. An additional ₹10,000 crore will be provided for PM Garib Kalyan Rozgar Yojana in FY21, she added.","20":"The Mumbai Zonal Unit of Directorate General of GST Intelligence has arrested four persons for committing a GST fraud by allegedly passing on fictitious Input Tax Credit (ITC) amounting to ₹408.67 crore. The four arrested are employees of Rane Megastructure, ACS Hardware and Networking, Keshariya Metal and group companies, and Shailaja Commercial Trade Frenzy.","21":"US private equity major Blackstone is reportedly in talks to buy the glass business of Indian conglomerate Piramal Enterprises for about $1 billion. Blackstone is also reportedly in talks with banks for a five-year loan worth $400 million to fund the deal. In June, Piramal sold a 20% stake of its pharma unit to US-based Carlyle Group for $490 million.","22":"Future Retail on Thursday told the Delhi High Court that Amazon \"isn't even a minority shareholder\" and has no say in its affairs. The Singapore International Arbitration Centre's (SIAC) order barring Future Retail from selling its assets to Reliance Industries is of no value, it added. The deal is needed to \"rescue Future Retail from bankruptcy\", the company's counsel said.","23":"The Centre and RBI have together provided a total fiscal stimulus package of ₹29.87 lakh crore since COVID-19 pandemic began and the amount is 15% of GDP, Finance Minister Nirmala Sitharaman said. Earlier on Thursday, Sitharaman unveiled a ₹2.65 lakh crore stimulus package, which included a ₹1.46 lakh crore Production-Linked Incentive scheme for 10 sectors already approved by the government.","24":"Following the conclusion of IPL 2020, commentator Aakash Chopra named his best IPL 2020 XI. He included three uncapped Indian players which include RR's Rahul Tewatia and MI's Ishan Kishan and Suryakumar Yadav. He named KL Rahul as wicketkeeper and captain. Other players include Shikhar Dhawan, AB de Villiers, Rashid Khan, Yuzvendra Chahal, Jofra Archer, Jasprit Bumrah and Kagiso Rabada.","25":"Praising Mumbai Indians batsman Suryakumar Yadav for his performance in IPL 2020, veteran off-spinner Harbhajan Singh said, \"He is the Indian AB de Villiers.\" Harbhajan added, \"It is difficult to stop him as he has all types of shots...He hits overs covers, plays the sweep also well, plays spin very well, plays fast bowling amazingly well.\"","26":"Ex-England captain Nasser Hussain has named his Team of IPL 2020, which includes six Indians and five foreigners. He named KL Rahul, the highest run-scorer this season as captain and AB de Villiers as wicket-keeper. Other players in the team include Shikhar Dhawan, Suryakumar Yadav, Ishan Kishan, Hardik Pandya, Jofra Archer, Rashid Khan, Kagiso Rabada, Jasprit Bumrah and Trent Boult.","27":"KKR co-owner Juhi Chawla criticised authorities for poor arrangement at airport after she returned to India from UAE. Juhi shared a video showing how passengers were stranded. She wrote, \"Request airport and govt authorities to immediately deploy more officials and counters at Airport Health clearance...all passengers stranded for hours after disembarking...Pathetic, shameful state!\"","28":"RCB and Australia leg-spinner Adam Zampa has said that there are two different versions of Team India captain Virat Kohli. Adding that he saw it first-hand playing with him, Zampa said, \"You see his aggression and how competitive he is on the field...but when he’s off the field he’s a lovely guy and very chilled out.\"","29":"BCCI Honorary Secretary Jay Shah has said the BCCI will leave no stone unturned in ensuring that the health and safety of everyone concerned in T20 World Cup 2021 is taken care of. He added, \"In these times of pandemic when there are severe restrictions, the BCCI believes in the policy of innovating...and I'm confident that we'll overcome every challenge.”","30":"Australia Test team captain Tim Paine, while representing Tasmania against New South Wales in a Sheffield Shield match, threw away his gloves in frustration after being given out LBW. The incident happened in the 81st over when Mitchell Starc trapped Paine in front of the wickets. However, as per the replays, the delivery could have gone down the leg side.","31":"Team India head coach took to Twitter to share a picture of himself with the team's support staff ahead of their departure for the tour of Australia. In the picture, the support staff members including Shastri can be seen wearing personalised PPE kits for Team India. \"Brothers in arms - One for all, and all for one,\" the caption read.","32":"West Indian batsman Sherfane Rutherford was spotted wearing Mumbai Indians jacket and mask as he joined his Pakistan Super League team Karachi Kings for playoffs. The 22-year-old was a part of IPL 2020 champions Mumbai Indians' squad though he didn't play a single IPL match this season. \"They should have sent a Karachi Kings tracksuit for him,\" a fan wrote.","33":"Mumbai Indians all-rounder Krunal Pandya was stopped by Directorate of Revenue Intelligence (DRI) at the Mumbai International Airport over suspicion of being in possession of undisclosed gold and other valuables, ANI quoting DRI sources said. Krunal was returning to Mumbai from UAE where he won the IPL 2020 with Mumbai Indians.","34":"Former India captain MS Dhoni will be farming Kadaknath chicken, the black chicken variety from Madhya Pradesh's Bheelanchal region, at his farmhouse in Ranchi. Dhoni's team has ordered 2,000 Kadaknath chicks from a poultry farmer in Jhabua district of Madhya Pradesh. As per the farmer, he has to deliver the chicks by December 15.","35":"Croatia defender Domagoj Vida was pulled out of a friendly match against Turkey at halftime because he tested positive for coronavirus, the country’s soccer federation said. The 31-year-old footballer, who plays for Turkish club Besiktas, was isolated from the rest of the squad after being substituted in Wednesday’s match. Vida had tested negative three days before the match.","36":"Pakistan Cricket Board (PCB) has extended Younis Khan's tenure as the men's team batting coach till the 2022 Twenty20 World Cup. PCB said apart from the national team, Younis will be working with the domestic batsmen. Younis, who is the only Pakistani batsman with 10,000 Test runs, said he is pleased to take up the job on a long-term basis.","37":"India's 1983 World Cup-winning captain Kapil Dev took to Twitter to share a video of himself playing golf after undergoing heart surgery in October. \"I can't express the feeling in words of how much I am enjoying the return to golf course. Beautiful to be back. That's what the life is all about,\" says the 61-year-old in the video.","38":"Pacer T Natarajan, who earned his maiden India call-up for T20I series against Australia, completed his vow by shaving off his beard after his daughter's birth. Natarajan had grown beard and vowed to shave it off only after his child's birth. Natarajan and his wife were blessed with their daughter on the morning of SRH's IPL 2020 Eliminator against RCB.","39":"Captain Rohit Sharma credited the discipline showed by MI on the field for their successful IPL 2020 campaign. \"It was a great season for us... We were disciplined as a team and we were disciplined on the field as well that is why we stand with the IPL trophy,\" Rohit said. MI beat DC by five wickets in the final.","40":"Former India cricketer Irfan Pathan believes DC will dominate IPL for the next four to five years \"like CSK used to earlier\". \"The best part is most of their players are young and that too with experience, which is a very rare combination,\" Pathan said. For the first time in IPL history, DC qualified for the final this season.","41":"BCCI President Sourav Ganguly said he was grateful to all the players of IPL 2020 for showing resolve and going through the bio-bubble to make this year's tournament a success. \"I personally thank all the players of each IPL team...It was tuff (tough) mentally, and your commitment makes Indian cricket what it is,\" Ganguly said.","42":"DC's Ravichandran Ashwin revealed how RCB captain and India teammate Virat Kohli never took any chance against him since it was a \"matter of pride\" for him to not give his wicket to the off-spinner. \"I have always loved bowling to Virat. He would never take chances against me,\" said Ashwin. \"MS Dhoni also, is like that,\" Ashwin added.","43":"DC wicket-keeper batsman Rishabh Pant praised his side for maintaining the fighting spirit despite going through all the ups and downs this season. \"Unfortunate to not finish the season on a high but so proud of the team...Thank you to all my teammates and coaches for your support,\" Pant added. \"We will be back stronger,\" the Delhi cricketer promised.","44":"Tokyo Olympics CEO Toshiro Muto said they will soon come up with measures to accommodate \"non-Japan residents\", thereby confirming for first time that they might allow foreign spectators at the event. \"By next spring we'll be coming up with measures for all spectators including the non-Japan residents,\" Muto said on Thursday. Earlier, Tokyo Olympics got postponed due to COVID-19 pandemic.","45":"Pakistan dropped all-rounder Shoaib Malik and pacer Mohammad Amir from their 35-member squad for the upcoming tour of New Zealand. Pakistan Cricket Board said 38-year-old Malik and 28-year-old Amir were left out as the selectors preferred a younger side, whose average age is 27.4. Asad Shafiq, who has played 77 Tests, was also dropped due to \"lack of form\".","46":"Australian off-spinner Nathan Lyon warned his side from being complacent since India captain Virat Kohli would be on a paternity leave during the Test series. \"It's still going to be a massive challenge for us. Just because Virat's not here doesn't mean we get to hold the trophy up. We've still got a lot of work to do,\" Lyon said.","47":"Cricket Australia named a 17-member squad on Thursday for the upcoming four-match Test series against India, starting December 17. Opener Will Pucovski and all-rounder Cameron Green are among the five uncapped players in the squad, along with Sean Abbott, Michael Neser and Mitchell Swepson. Pucovski recently hit successive double hundreds in his two Sheffield Shield appearances, scoring 495 runs.","48":"Former Argentine footballer Diego Maradona was released from a Buenos Aires hospital on Wednesday where he had undergone a brain surgery last week. His lawyer said he would continue to recover in private and would also continue receiving his treatment for alcohol dependency. Maradona underwent a surgery last Tuesday to remove a blood clot lodged between his brain and skull.","49":"Dyson mentions that the Pure Hot+Cool is the only air purifier and heater in one which is scientifically tested to capture pollutants as small as PM 0.1, including bacteria & viruses. Dyson further adds that only Dyson purifiers come with vacuum-sealed H-13 HEPA filters, 350° oscillation and Air Multiplier™ technology to project purified air to every corner of the room.","50":"YouTube users worldwide reported on Thursday morning that the video-sharing platform was down for more than an hour. A lot of users said they were having trouble in watching YouTube videos as they were blocked with an error message. \"We're so sorry for the interruption. This is fixed across all devices & YouTube services,\" YouTube tweeted at 7:43 am.","51":"India's richest man Mukesh Ambani's RIL has announced an investment of up to $50 million in US-based coalition Breakthrough Energy's clean energy fund, Breakthrough Energy Ventures. Founded by world's second-richest man Bill Gates, Breakthrough Energy is a group of HNIs to fund clean energy companies. The $50 million investment constitutes 5.75% of the size of the fund contemplated at present.","52":"South Korea's PUBG Corporation on Thursday announced that it is preparing to launch 'PUBG Mobile India', which has been specially created for India.  Additionally, the company said it plans to make investments worth $100 million in India. It will also create an Indian subsidiary which will hire over 100 employees specialising in business, esports and game development. ","53":"Google Photos on Wednesday announced it is ending free, unlimited storage for high-quality photos from June 1, 2021. Any new photos and videos uploaded will then start counting toward the free 15GB Google Account storage. \"Original quality\" images were the only ones to previously count against the limit. However, high-quality photos uploaded before June 1 won't count against the cap.","54":"Cartoon characters like 'Mickey Mouse', 'Minnie Mouse', 'Bugs Bunny', 'Daphane Duck', 'Sleeping Beauty' and others appeared in the list of people summoned to a UK court due to a testing error. The court was testing a new upgrade to case management system and the names were created as test cases. However, dummy names weren't deleted before the lists were published.","55":"Facebook on Wednesday said it expects the post-election ban on political advertisements to last another month. Facebook had banned such ads on its platform to fight misinformation related to US presidential election. \"While multiple sources have projected a presidential winner, we believe it's important to help prevent confusion or abuse on our platform,\" Facebook wrote in an email to advertisers.","56":"Snap, the company behind Snapchat, has acquired Israeli AI-based voice assistant startup Voca.ai for $70 million, as per reports. All of Voca's 40 employees will now reportedly join Snap. The startup, which develops call centre voice assistants has raised $6 million till date, from investors such as American Express Ventures and Flint Capital. ","57":"Germany's Federal Cartel Office has opened an inquiry into messaging apps like WhatsApp citing possible violations of consumer protection law. The regulatory body's president has questioned the extent to which personal data of users was being protected by the apps. The probe will also examine whether interoperability of apps could allow users to choose services that offer better data protection.","58":"Southwest Research Institute engineers say they were able to interfere with the charging process of an EV by simulating a malicious attack under an automotive cybersecurity research initiative. They reverse-engineered the signals and circuits on an EV and a J1772 charger. They performed three manipulations- limiting the rate of charging, blocking battery charging and overcharging.","59":"The Treasury Department of US has said that it wants a resolution of the national security concerns it has raised over ByteDance's acquisition of Musical.ly, which it later merged into TikTok. The statement comes after ByteDance challenged Trump administration's order which requires it to sell TikTok to a US entity by Thursday. ByteDance acquired Musical.ly in 2017.","60":"Singapore has announced a work visa called Tech.Pass for technology firms executives. Under the programme launching in January, up to 500 executives can apply for two-year visas which will allow them to operate a business, invest in or become a director in Singapore-based companies, and mentor startups. Employees with previous monthly salary of $20,000 and five years' experience can apply.","61":"Several social media users accused WHO of censoring messages mentioning \"Taiwan\" during its live-stream on Facebook. Users complained of censorship after comments containing the word \"Taiwan\" failed to upload. \"If it's true, it'd be an outrage to see the WHO and Facebook teaming up to do China's dirty work,\" Representative of Taipei Economic and Cultural Representative Office, Bi-khim Hsiao said.","62":"A former Facebook employee, while deposing before Delhi Assembly's Peace and Harmony Committee, claimed that the platform is \"profiting off hate\" by determining whether or not to show \"hateful and divisive content\" on its platform. He claimed that Facebook \"influences and aids\" violence and misinformation to go on. The committee is probing Facebook's alleged role in Delhi riots in February.","63":"England's test-and-trace system was hit by \"huge\" technical issues last month which led to delays of up to 48 hours in reaching potentially infected people, The Guardian reported. The failure occurred when number of COVID-19 cases were rising exponentially. The issues reportedly occurred in Sitel's software system which is being paid £82 million by the government to run the system.","64":"Twitter will reportedly roll out a feature that will help users filter graphic media in their Direct Messages (DMs). The filter appears with a toggle button to enable or disable graphic content, most likely photos and videos, as spotted by an engineer. The option to view the media will still remain, as per reports.","65":"The National Payments Corporation of India (NPCI) could moderate the onboarding of new users to enforce its 30% cap on the total volume of UPI transactions through third-party apps, ET reported. It could also mandate banks operating as payment service providers to third-party apps such as Google Pay to monitor their market share and report to NPCI, the report added.","66":"The WHO has said that it filtered content on social media with keywords \"Taiwan\" and \"China\" after it faced an \"onslaught of cyberattacks\" following Taiwan's failure to get into the organisation. It said filters were applied to avoid users from getting spammed through cyberattacks. Taiwan's Foreign Ministry earlier said the censorship ran contrary to the neutrality WHO should be upholding.","67":"A group of 165 critics including US and UK companies and peers in 21 European Union (EU) countries wrote to EU's antitrust chief alleging Google unfairly favours its own services on web searches. The group, which includes Yelp, Trivago and Expedia, urged EU to prevent such malpractices. Google said its users are not locked in and can use competitors.","68":"The Ministry of Electronics and Information Technology (MeitY) has issued a notice to Twitter seeking an explanation within five days as to why legal action shouldn't be taken against the platform for showing Leh as part of Jammu and Kashmir instead of Ladakh. Twitter's action is a \"deliberate attempt...to undermine the will of sovereign Parliament of India\", the notice said.","69":"The Director General of Cellular Operators Association of India (COAI) SP Kochhar said that the PLI scheme reflects the government's commitment towards the 'Make in India' initiative. The telecom industry has been \"extremely resilient\" during COVID-19 pandemic and played a pivotal role in supporting other sectors, he added. The PLI scheme outlays ₹12,195 crore for telecom and networking products.","70":"The UN's Special Rapporteur on contemporary forms of racism, Professor Tendayi Achiume, has called for a moratorium on the use of surveillance technologies in border enforcement, saying they can be unfair and breach human rights. It's a misconception that technologies used in border enforcement are without bias, she said. Border deaths have increased in places with smart borders, she added.","71":"German air taxi startup Lilium has said it'll set up its first US hub at Lake Nona, a \"futuristic smart city\" near Orlando International Airport in Florida. The startup is expecting the hub to start operations in 2025. The project will be backed by the City of Orlando. Lilium has a similar port planned in Dusseldorf, Germany.","72":"The students of Netherlands' Eindhoven University of Technology have developed an electric car that's entirely made out of waste materials, such as recycled PET bottles, plastics drained out of water bodies and household garbage. The two-seater car, named \"Luca\", has a top speed of 90 km\/hour and a reach of 220 km when it is fully charged.","73":"Actor Asif Basra was found hanging in a private complex in Himachal Pradesh's Dharamshala, ANI reported on Thursday quoting Kangra Police official Vimukt Ranjan. \"Forensic team is at the spot and police is investigating the matter,\" the police official said. The 53-year-old actor acted in several Bollywood films including 'Kai Po Che!', 'Black Friday' and 'Hichki'.","74":"Following the demise of Asif Basra, director Imtiaz Ali said, \"The news of his demise is very shocking and disturbing.\" He added that he cast Asif in 'Jab We Met' as he wanted an intelligent actor who could convey what he was trying to say. Imtiaz further said, \"Asif was an engaging actor. I will miss him in the movies.\"","75":"American singer Mary Millben on Wednesday released a rendition of 'Om Jai Jagdish Hare' as her Diwali greetings to people across the globe, particularly in India and the US, celebrating the festival of lights. \"'Om Jai Jagdish Hare', a beautiful Hindi hymn...is a song of worship and celebration. This hymn continues to...stir my passion for Indian culture,\" said Millben.","76":"Model-actor Milind Soman shared pictures from May 2012 and wrote, \"1,500 km run through five states from Delhi to Mumbai in 30 days. It was an initiative to talk about issues concerning the degradation of the environment.\" \"But...talking once or twice or even 100 times doesn't make much of a difference...We need to take positive action every day,\" he added.","77":"Actor Manoj Bajpayee expressed his shock over the news of 53-year-old actor Asif Basra found hanging at a private complex in Himachal Pradesh's Dharamshala on Thursday. \"What? This is too shocking!! Shot with him just before Lockdown!!! Oh My God!!!,\" Manoj Bajpayee tweeted. Director Hansal Mehta tweeted, \"Asif Basra! Can't be true... This is just very, very sad.\"","78":"Actor Saif Ali Khan spoke about working amid COVID-19 pandemic and said, \"Acting is a high-risk profession, it's almost like working in a hospital.\" The actor said, \"During lockdown, we quietly sat at home for six months...lost our time.\" He added, \"Now when the government is saying go out and work to support the economy...We are in the frontline again.\"","79":"'Balika Vadhu' fame actress Avika Gor took to Instagram on Wednesday to confirm her relationship with Milind Chandwani, who participated in Roadies Real Heroes 2019. \"This kind human is mine. And I'm his forever,\" she wrote while sharing a collage. \"We all deserve a partner that understands us, believes in us, inspires us...& truly cares for us,\" Avika added.","80":"Actress Kangana Ranaut took to social media to share pictures from her brother Aksht's wedding in Udaipur. \"Welcome to our family Ritu,\" she wrote. \"Dear friends, bless my brother Aksht and his new bride Ritu, hope they find great companionship in this new phase of their lives,\" the actress wrote in another tweet.","81":"Taking to Instagram on Thursday, actress Neetu Kapoor shared a picture of herself with the cast of her upcoming film, 'Jug Jug Jiyo', and remembered her late husband, actor Rishi Kapoor. \"My first flight, in these scary times!! Nervous for this journey!! While Kapoor Sahab, you aren't here holding my hand, I know you are with me,\" she wrote. ","82":"Saif Ali Khan, who's shooting for 'Bhoot Police' in Dharamshala amid the coronavirus pandemic, has said a film set is a \"very dangerous environment at this time\" because there are a lot of people on the set. \"People are trying their best, but it's still dangerous,\" he added. \"It's a high-risk profession, almost like working at a hospital,\" Saif said.","83":"Talking about working with Mohammed Zeeshan Ayyub in 'Chhalaang', Rajkummar Rao said that he loves being with him on-screen and off-screen. He added that he's a fan of Zeeshan and couldn't have asked for a better co-star. \"We were blessed to have him on board...It was so much fun to work with him...and he's such a funny guy,\" Rajkummar said.","84":"Pakistani actor Bilal Abbas Khan has said he wants to work with filmmaker Vishal Bhardwaj. \"I've seen all his films like 'Omkara', 'Kaminey', 'Haider' and 'Maqbool'. His understanding of cinema is amazing...he is my all-time favourite,\" he added. \"I aspire to be part of films that comprise performance-driven characters and a powerful storyline,\" Bilal further said. ","85":"'Dabangg 3' producer Nikhil Dwivedi, who also starred in films like 'Hate Story' and 'Raavan', has said he became a producer due to lack of good acting offers. \"Had I been offered good work earlier...I'd have still been acting...I was forced to turn to production because I had to do something,\" he added. Nikhil was recently seen in 'Scam 1992'.","86":"On being asked about his marriage plans with girlfriend-actress Kriti Kharbanda, Pulkit Samrat said, \"We've currently decided to concentrate on our work and our individual careers.\" He added, \"We're working with the best in business. So the best thing is to support each other...So right now, marriage will happen when it has to but our first priority will be work.\"","87":"Actor-singer Dhanush, who's also the son-in-law of Rajinikanth, will essay the role of the 69-year-old actor in his upcoming biopic, as per reports. It'll be directed by N Lingusamy, who previously helmed films like 'Run', 'Paiyaa' and 'Vettai', reports added. Dhanush will be next seen in Aanand L Rai's 'Atrangi Re', which also stars Akshay Kumar and Sara Ali Khan.","88":"Actor Arjun Rampal's girlfriend Gabriella Demetriades on Thursday appeared before the Narcotics Control Bureau (NCB), after being summoned for the second consecutive day in a drug-related case. \"We have now told Arjun Rampal to appear before NCB on Friday,\" NCB zonal director Sameer Wankhede said. This comes after NCB raided Arjun's house and seized banned medicines and electronic devices.","89":"Actor Sharad Kelkar, who played the role of a transgender in Akshay Kumar-starrer 'Laxmii', said, \"The film is an eye-opener film...I evolved a lot since...beginning of 'Laxmii'.\" He added that he had different notions about transgenders earlier but now has huge respect for them. \"People are talking about equality right now, I think they're far more superior,\" Sharad further said. ","90":"Singer Britney Spears' lawyer told Los Angeles Superior Court that she would not resume her career as long as her father, Jamie Spears, is involved. \"My client has informed me that she is afraid of her father,\" Britney's lawyer said. The court was overseeing the conservatorship (guardianship) of Britney's career which began in 2008 owing to her mental struggles.","91":"Madhya Pradesh HC refused to quash an FIR against producer Ekta Kapoor over allegations of obscenity and dishonouring the national emblem and Indian Army in the series 'XXX'. Ekta claimed that she had no idea about the contents of an episode. HC rejected her argument stating that she is presumed to \"have knowledge\" of whatever is shown on ALTBalaji.","92":"After the Maharashtra government advised people to celebrate a firecracker-free Diwali due to coronavirus pandemic, actress Swara Bhasker said, \"I think given the context of the pandemic in Maharashtra, we must all refrain from burning firecrackers.\" She added that anyone bursting firecrackers this year is \"doing something very irresponsible and doing a great disservice to society\". ","93":"While talking about her relationship with Pulkit Samrat, Kriti Kharbanda said that he has taught her how to feel secure as an actor. \"I love how he is evolving...I am very proud as a friend, girlfriend and a co-star,\" she added. \"If he wasn't a good co-actor to me, we would not be where we are today personally,\" Kriti said.","94":"Actor Himansh Kohli said that people didn't think once before abusing his parents after his ex-girlfriend, singer Neha Kakkar's marriage to Rohanpreet Singh. \"It took some time for my parents to worry less about all the messages sent to them,\" Himansh further said. This comes after Himansh criticised a video claiming he apologised to Neha \"for hurting\" her.","95":"Actress Shilpa Shetty Kundra, who made her debut in 1993 with Shah Rukh Khan-starrer 'Baazigar', on Thursday completed 27 years in the film industry. Taking to Twitter, the actress wrote, \"It feels unreal.\" Shilpa added, \"It's been 27 years since Baazigar released, and I was welcomed by the fraternity and the audience with open arms. I've nothing but tremendous gratitude.\"","96":"Several celebrities, including Nawazuddin Siddiqui, Shraddha Kapoor and Divya Dutta, mourned the demise of actor Asif Basra, who was found hanging in a private complex in Dharamshala. Divya tweeted, \"Terribly shocked. We shot together for #hostages2. Looked such a happy free-spirited man! This is hard to digest.\" Meanwhile, Nawazuddin wrote, \"It's unbelievable, yet another loss of a dear friend.\" ","97":"Actor Arjun Rampal has been summoned by the NCB on November 13 for questioning in connection with a drug-related case. Earlier, NCB had seized some electronic gadgets and banned medicines from his residence during a raid. Arjun's girlfriend Gabriella Demetriades, who appeared before the agency on Wednesday, was called in for the second round of questioning on Thursday."}}