{"title":{"0":"Your Education is an Investment","1":"What is Machine Learning?","2":"What are the Math and Stats Principles You Need for Data Science?","3":"How We’re Celebrating World Mental Health Day From Home ","4":"What is Codeup’s Application Process?","5":"How Codeup Alumni are Helping to Make Water","6":"Codeup Grads Win CivTech Datathon","7":"Codeup on Inc. 5000 Fastest Growing Private Companies in America!","8":"Codeup Launches Houston!","9":"Build Your Career in Tech: Advice from Alumni!","10":"How Codeup Alumni Helped Dallas Youth Fight COVID-19","11":"What to Expect at Codeup","12":"How to Succeed in a Coding Bootcamp","13":"Introducing Our Salary Refund Guarantee","14":"What is the Transition into Data Science Like?","15":"Announcing: The Annie Easley Scholarship to Support the Black Community in Tech","16":"What Data Science Career is For You?","17":"Alumni Share their Journey into Web Development","18":"From Slacker to Data Scientist: Journey to Data Science Without a Degree","19":"What is Python?"},"content":{"0":"You have many options regarding educational routes to your desired career path, so why choose Codeup? That’s something only you can decide. Some people love that it’s 10x faster than a college degree, others love that you’ll graduate with more projects and experience than many college graduates. Maybe for you, our job placement services, where we help you perfect your resume, LinkedIn, and interview skills, with a whole team dedicated to finding you a job, is worth the $27,500 tuition. Or maybe you’ll love the Codeup community, with staff always willing to help you, alumni always willing to mentor you, and even after you graduate, you will continue to see support from Codeup in the form of continuing job placement assistance, events, newsletters, supportive Slack channels, and social media sharing of your coolest projects.\nClearly, there are lots of pros to investing in Codeup! There are also potential cons to other routes, such as missed opportunity cost, learning fewer skills across a longer time span, and missing out on work experience while spending more time in another institution. However, what you deem a “pro” and a “con” may look different, and what exactly you prioritize when thinking about large investments will also differ. \nTo get some assistance on how to navigate whether or not Codeup is worth the investment to you, specifically, and to see how Codeup stacks up against other options, please download our PDF: “Education Finance 101: Think of your education as an investment” where we’ll walk you step-by-step through how to measure the return on investment of various educational routes. \nCalculate for yourself if Codeup is worth it! Over 700 alumni thought so.\n \n\n \nHave questions? Reach out!\n\n","1":"There’s a lot we can learn about machines, and there’s a lot machines can learn about us, too! Ever wonder how virtual personal assistants or dating apps work? Or how Netflix picks the perfect show for you? They’re learning from you by optimizing and building upon human-created algorithms. Each text you type, person you swipe, or show you pick is stored as data, and through a process called machine learning, that data is plugged into algorithms to streamline your next texting, dating, or show-picking experience.\n“Shows You Might Like”\nLet’s take any entertainment streaming service. It stores information about the titles you’ve watched, like genre, actors, year, category, and how (if) you rated them, in order to recommend other titles you may also enjoy. It also considers what other titles members with similar preferences have enjoyed. All of this data is stored and used as input in algorithms, which are sets of rules that solve a problem. The problem, in this case, is that you might like to have a new show to watch.\nAs you continue interacting with your entertainment streaming service, the better the recommendations will be, because the more data it has on what you choose to watch. \nIs the machine really learning?\nYes! Well, it’s learning what humans tell it to learn. The same way we might read through a book given to us to study and memorize course material, the computer gathers and stores the data we tell it to store. However, we can choose to go beyond that book and learn from other sources by running an internet search or asking others. The machine lacks the intelligence to do this on its own, but if it was programmed to do so by a human, it could.\nSo, what is machine learning?\nWikipedia defines machine learning as “the study of computer algorithms that improve automatically through experience.” The key word here is “automatically.” A human manually sets up an algorithm that the machine uses to come to conclusions, but the more data the machine has, the more it has to “learn” from to improve its conclusions, without the need for a human programmer. However, the machine is only improving upon the algorithm, optimizing the output it gives with the more data it has, and not creating its own algorithms. Humans will always be needed to tell the machines what to do.\nWant to teach a machine how to learn?\nIf this sounds cool to you, have you ever considered a career in data science? There are a number of fascinating things to learn about data science and machine learning, and the best way to learn is with hands-on experience through numerous projects and fully-immersive learning. Click here to learn about how Codeup provides all that and more in order to set you up in one of the most interesting tech careers out there. Applying is absolutely free, takes only 5 minutes or less, and if you don’t get a job in-field, we refund your tuition.\n\n","2":"Coming into our Data Science program, you will need to know some math and stats. However, many of our applicants actually learn in the application process – you don’t need to be an expert before applying! Data science is a very accessible field to anyone dedicated to learning new skills, and we can work with any applicant to help them learn what they need to know. But what “skills” do we mean, exactly? Just how much math and stats do you need to know?\nWhat are the main math principles you need to know to get into Codeup’s Data Science program?\n\n\nAlgebra\nDo you know PEMDAS and can you solve for x? You will need to be or become comfortable with the following: \n\nVariables (x, y, n, etc.)\nFormulas, functions, and variable manipulations (e.g. x^2 = x + 6, solve for x).\nOrder of evaluation: PEMDAS: parentheses, exponents, then multiplication, division, addition, and subtraction\nCommutativity where a + b = b + a\nAssociativity where a + (b + c) = (a + b) + c\nAdding and subtracting matrices\nA conceptual understanding of exponential growth\/decay- things can increase at an increasing rate\n\nDescriptive Statistics\nKnow what a min, max, mode, median, and average are. Have a conceptual understanding that stats\/probability is about trying to quantify uncertainty.\nData Visualization\nKnow what a scatterplot is and how to read a barplot.\nHow to Learn and Expand on These Concepts\nThere are a number of great resources out there to teach you these and similar concepts. Khan Academy is a great starting place! If you want to know what exactly we assign our applicants, you’ll just have to apply!\n \nWhat about once you’re in Codeup?\n\n\nWhat You Won’t Do\nDo we do any mathematical proofs for concepts or perform derivations? No. \nDo we do any calculus and probability calculating by hand? No.\nAre we transforming equations, where we cancel out units or terms and do lots of algebraic gymnastics? No\nWhat You Will Do\nWill we have Python solve our linear algebra problems for us? Yes\nWill we have Python calculate probabilities, the area under a curve, and the slope of a line for us? Yes\nWill we have Python do all of the calculus for us? Yes\n \nSee, the math and stats slice of the data science pie is certainly doable. If you like problem-solving and are ready to challenge yourself, you’ll love data science! If you are interested in learning about data science, just apply! Our Admissions Manager can work with you to get you where you need to be starting from where you are now. Let us help you get there so you can launch a great new career.\n\n","3":"World Mental Health Day is on October 10th. All of us at Codeup have been working remotely and finding ways to care for ourselves during this transition. We’re pretty excited to celebrate World Mental Health Day, and think you should be, too! However you choose to celebrate, make sure it’s something that relieves your stress and anxiety, not adds to it. (AKA, Don’t read the book you hate or force yourself to do your least favorite workout.) Here are some recommendations from Codeup team members.\n \nFinding Support Online\nNeed counseling services? MDlive.com is the way to go! \nGoing through a breakup? There’s an app for that! Use the Mend app and letsmend.com!\nToo much going on in the world? Try staying off social media for the day.\nWant to see if you like meditation? Check out this video to just jump right in.\n\n \nMaintaining Mental Health through Physical Health (Pick One)\nEat a salad.\nCook your favorite dish to eat.\nCook your favorite dish to make,\nGo on a hike.\nTake a walk.\nTake one of your daily activities outside, like reading, eating lunch, or meditating.\nStart a timed diet challenge, like the Whole 30! \n \nPracticing “Play” as Adults\nAsk yourself ‘what brought me joy as a child?’ and spend more time doing that as an adult. \nRe-read your favorite science fiction book.\nSing to a karaoke machine or karaoke videos.\nCreate dance routines to old bops.\nColor. (Just grab a blank sheet of paper, an old set of crayons, and draw whatever comes to mind- just like when you were a kid!)\nYou don’t need us to remind you that mental health is critical right now. World Mental Health Day is just the excuse you need to take a breather, get support, go outside, eat well, play, and celebrate your progress. So which activity will it be? We recommend picking something from each of the above sections! In the words of Shia La Beauf and Nike “just do it.”\n \n\n\n","4":"Curious about Codeup’s application process? Wondering why you need to apply so far in advance? You’ve come to the right blog post! From pre-work to technical assessments, to financial aid and interviews, there are a number of reasons you need to apply 1-2 months ahead of your start date. To explain Codeup’s application process, let’s start by working backward.\n \nWeb Development & Data Science\nNote: The tilde (squiggly) means “approximately”.\n \nPre-work (~1 month)\nAfter being accepted, every incoming student is given a set of pre-work to do to familiarize themselves with some coding basics. You won’t be expected to have everything memorized, but some exposure will be required for you to hit the ground running on your first week of class. Many have likened our bootcamp to drinking out of a firehose- there’s a lot of ground to cover in 5 months! Completing the pre-work is the best gift you can give yourself in order to soften the blow. Take the start date you are considering, and subtract a month. You should be accepted by that date in order to finish the prework. \n \nTuition Planning (~1 month, concurrent with pre-work)\nOnce you’re accepted, you’ll meet with our Financial Aid and Enrollment Manager to discuss your financial aid options. She’s also Codeup’s School Certifying Official for VA Benefits, which take roughly 2 weeks to be processed. Scholarships are awarded about 2 weeks before the first class day, so you will need to have applied for any scholarships before then. Grants can range from 2-8 weeks to be processed and secured, but usually take about a month. You will need to be accepted before applying for grants. The tuition process is finalized in the month leading up to the start date, while you’re also working on prework.\n \nBehavioral Interview (~30 min)\nThink of this as a casual job interview. We want to make sure you are culturally and behaviorally cut out for Codeup. The intensity and rigor is not for everyone. We’re looking for motivated, positive, hard-working, and dedicated character traits. Bonus points if you read our blog post about tips for nailing a video interview beforehand!  \n \nTechnical Assessments (~1-2 weeks for Web Development, ~1-4 weeks for Data Science)\nFor Web Development, we will give a couple of technical assessments to test your problem-solving skills. They are not necessarily pass\/fail tests, but rather, they help us see how we can best prepare you for class. Those who do not do well on the first challenge have additional opportunities to develop their problem-solving skills. We want to be sure you are set up for success in class! \nFor Data Science, the technical assessments may take much longer as there are more prerequisites, but it varies from person to person. We require a basic level of Python, math, and stats prior to being accepted. How well versed you are in those subjects determines how long this process takes. Could be a week if you were a math major in college, could be months if you’ve never heard of Applied Statistics. Plenty of our students knew nothing about stats or Python before applying but worked through our recommended resources (tutorials and workshops) in order to get to the level they need to be on. Don’t count yourself out! But do be realistic about how long it will take you to learn. If you were to apply for our Data Science program a couple weeks before class starts, knowing nothing about Python or stats, our Admissions Manager will be happy to provide all the necessary resources you need for a future start date, but you may not be qualified in time for the next class start, considering you’d also have to finish pre-work in that limited time. \nFor both programs, we have weekly study sessions with our Teaching Assistants to help you with any material that’s causing you trouble!\n \nCampus Visit (~1 hour, same week as application)\nWe may be virtual right now, but we’re still doing virtual campus visits! You can think of this as a program overview. We’ll discuss the admissions process, the curriculum, the schedule, how things are looking now that we’re remote, and any questions you might have.\n \nPhone Call (~15-30 minutes, same week as application)\nYou can think of this as an initial admissions consultation or phone interview, but really we’re just making sure it’s the right fit! Some people think applying for Codeup means getting paid to learn to code, some people think we teach medical coding. This call is just to introduce ourselves, make sure you’re crystal clear on what Codeup is (a full-time career accelerator that trains and places data scientists and software developers), and to answer any questions you might have.\n \nApplication (<5 minutes)\nThe first step is your application! It’s basically just sending us your name and contact info so we can get the ball rolling on making you a Data Scientist or Software Developer! How exciting!\nNow, are you pumped to begin your own journey through Codeup’s application process and experience all this in action? You can fill out your super quick application here. Our (helpful and friendly) Admissions team will be in touch ASAP to help you change careers. Even if you’re not sure if Codeup is right for you, we can help you work through your doubts and hesitancies in your initial phone call. \n \nWith an Admissions Manager as your guide, our Teaching Assistants as your personal tutors, and our Financial Aid and Enrollment Manager as your tuition planning assistant, you’ll never have to go at this alone! Apply now!\n\n","5":"Imagine having a kit mailed to you with all the necessary components to make contaminated water clean. Cool, huh? Four of our alumni are helping to make that possible by partnering with the non-profit Elequa to design a website for their Make Water program. With this project, these Codeup alumni have the potential to make a global impact: Jacqueline Murralles, James Murralles, Ted Zamarron, and Carlos Teller. \nHow Elequa is Making a Difference\nThe Make Water program inspires, educates, and equips people that want to make a tangible difference in the world. Elequa puts together DIY kits with the tools to purify water and delivers them to people that need them, locally and abroad. This project is also given to students in the San Antonio area, who in turn are challenged to research, tweak, and further develop the kits to make them better and more accessible. These problem-solving challenges engage students in the STEM field, inspiring teamwork and collaboration while making a difference that they can be proud of: helping to provide clean water.\nHow Codeup Alumni are Making a Difference\nCurrently, the Make Water program lacks a platform to house and share the data gathered by students to improve the kits, while also challenging other community members for further development. They needed help with the gamification of these processes to make participation more engaging. That’s where Codeup alumni Jacqueline Murralles, James Murralles, Ted Zamarron, and Carlos Teller came in. They are helping Elequa to build an open-source application for the Make Water program that turns community participation into a game where users can level up as they contribute and collaborate through an array of real-world challenges in water research, coding, hardware innovation, and creative storytelling.\nDid we mention that they are working on this project as volunteers, as Codeup alumni often do? Codeup students are always looking for ways to challenge themselves, sharpen their skills, and make a difference, and that continues after graduation. To see more of the projects our students have worked on (and what you can do, too, with Codeup), check out these capstone presentations.\n\n","6":"Many Codeup alumni enjoy competing in hackathons and similar competitions. Now that we train Data Scientists, recent alumni have been competing in datathons, too. At the 2020 CivTech Datathon, teams from two Data Science cohorts, Bayes and Curie, took 1st and 2nd place! The Codeup community is killin’ it at these events and we can’t wait to highlight their achievements!\n \nWhat is CivTech Datathon?\nCivTechSA is a partnership between Geekdom, a coworking space that every current Codeup student has complimentary access to, and San Antonio’s Office of Innovation. In an effort to connect local communities, ideas, and data to help improve the City’s services, the CivTech Datathon competition was born! Using public datasets, competitors look for missing data and areas for improvement and identify impactful solutions to current civic problems. Then, they present their insights to City of San Antonio departments like San Antonio Water System (SAWS) and Via Metropolitan Transit.\n\nCodeup Alumni Take First and Second Place in 2020\nBoasting first place was the Curie team We Came, We SAWS, We Conquered with Ryan McCall, David Wederstrandt Sr., Chase Thompson, Cameron Taylor, and Jeremy Cobb. They used data from SAWS regarding sanitary sewer overflow (SSO) events and weather data from the National Oceanic and Atmospheric Association to predict the root causes of SSO events. They generated a system that SAWS could use to prioritize maintenance of the sewers to limit the risk of these events, with the potential to save hundreds of millions of city dollars while keeping gastrointestinal health risks at bay.\nTaking second place was team Get on the Bus with Sean Oslin, Sara Pena, Fredrick Lambuth, Misty Garcia, Kevin Eliasen, and Faith Kane. With their project, they aim to increase ridership of public transportation. Using open data from VIA and the Census Bureau Data API, this team identified areas of improvement to make our community more diverse and equitable by making buses more accessible.\n\nWe Won in 2019, Too\nAs a special shoutout, at the 2019 CivTech Datathon, a team from our very first Data Science cohort competed and won the “Most Solvable” award. The team members were Ednalyn C. De Dios, Joseph Burton, and Sandra Graham. Their project was similar to our Curie team – they trained a model to predict which pipes would overflow.\n\nWant to Compete Next Year?\nIf you’re passionate about improving civic issues and want to present your findings to city stakeholders too someday, Codeup can teach you how! You might actually inspire lasting change (or at least get thousands of dollars in prize money)! If these Codeup students could win first and second place at the datathon, what’s stopping you? Click here to learn more about our Data Science program. Then, we’ll see you at next year’s CivTech Datathon!\n\n","7":"We’re excited to announce a huge Codeup achievement! Inc. magazine has placed Codeup at No. 3309 on its annual Inc. 5000 list, the most prestigious ranking of the nation’s fastest-growing private companies. The list represents a unique look at the most successful companies within the American economy’s most dynamic segment— independent small businesses. Intuit, Zappos, Under Armour, Microsoft, Patagonia, and many other well-known names gained their first national exposure as honorees on the Inc. 5000.\n \n\n“The secret sauce of Codeup is the people that work here. I’m very excited to work with this team every day to deliver great outcomes for our students. The growth we’ve experienced has allowed us to bring more great people into our company. This has allowed us to face 2020 better positioned for the future.” \n– Jason Straughan, Codeup CEO & Co-Founder\n\n \nNot only have the companies on the 2020 Inc. 5000 been very competitive within their markets, but the list as a whole shows staggering growth compared with prior lists as well. The 2020 Inc. 5000 achieved an incredible three-year average growth of over 500 percent and a median rate of 165 percent. The Inc. 5000’s aggregate revenue was $209 billion in 2019, accounting for over 1 million jobs over the past three years.  \nComplete results of the Inc. 5000, including company profiles and an interactive database that can be sorted by industry, region, and other criteria, can be found at www.inc.com\/inc5000. The top 500 companies are also being featured in the September 2020 issue of Inc.\n“The companies on this year’s Inc. 5000 come from nearly every realm of business,” says Inc. editor-in-chief Scott Omelianuk. “From health and software to media and hospitality, the 2020 list proves that no matter the sector, incredible growth is based on the foundations of tenacity and opportunism.”\n \nMore about Inc. and the Inc. 5000\n \n\n\nMethodology\nThe 2020 Inc. 5000 is ranked according to percentage revenue growth when comparing 2016 and 2019. To qualify, companies must have been founded and generating revenue by March 31, 2016. They had to be U.S.-based, privately held, for-profit, and independent—not subsidiaries or divisions of other companies—as of December 31, 2019. (Since then, a number of companies on the list have gone public or been acquired.) As always, Inc. reserves the right to decline applicants for subjective reasons. Companies on the Inc. 500 are featured in Inc.’s September issue. They represent the top tier of the Inc. 5000, which can be found at http:\/\/www.inc.com\/inc5000.\n \nAbout Inc. Media\nThe world’s most trusted business-media brand, Inc. offers entrepreneurs the knowledge, tools, connections, and community to build great companies. Its award-winning multiplatform content reaches more than 50 million people each month across a variety of channels including websites, newsletters, social media, podcasts, and print. Its prestigious Inc. 5000 list, produced every year since 1982, analyzes company data to recognize the fastest-growing privately held businesses in the United States. The global recognition that comes with inclusion in the 5000 gives the founders of the best businesses an opportunity to engage with an exclusive community of their peers, and the credibility that helps them drive sales and recruit talent. The associated Inc. 5000 Conference is part of a highly acclaimed portfolio of bespoke events produced by Inc. For more information, visit www.inc.com.\nFor more information on the Inc. 5000 Conference, visit http:\/\/conference.inc.com\/. \n \nAbout Codeup\nCodeup is a career accelerator for adults looking to transition into careers in web development and data science. This transition is completed over 22-weeks of hands-on, project-based curriculum, supplemented by professional development and assistance with the ensuing job search. All backed by our tuition refund. Interested in learning more? Contact us today! You can also learn more about our growth by checking out our 2019 Year in Review!\n \n\n","8":"Houston, we have a problem: there aren’t enough software developers! After 6 years of helping adults transition into tech careers in San Antonio, and 1 year of operating in Dallas, it’s time to spread Codeup even farther across Texas. What better place than Houston, the largest city in Texas, and one of the top five largest cities in the country?\n \nWhy Houston?\nIn Houston, the demand for tech talent is high, the population is vast and diverse, and Texas still has the 10th largest economy in the world. With a commitment to placing our graduates in real tech jobs, we go where the demand is and where our employer partnerships lead. \n \nWhat does this mean now that classes are remote?\nLaunching a new campus during this pandemic won’t change much from the student perspective. Just like before, people from all across Texas can enroll in our programs, and classes will continue to be remote until it is safe to open our campuses. However, with a physical presence in Houston, we will be able to better expand our employer partnerships and build our network so students can get the best experience possible!\n \nWhat are my career options?\nYou can become a software developer after 22 weeks in our virtual Full-Stack Web Development program. Classes are conducted live via Zoom along with your classmates. Interested in building custom applications? Learn more about how to bring your ideas to life with Codeup here.\nWhile we won’t officially be launching our Data Science program in Houston, people all across Texas still have the rare opportunity to attend the Data Science program that’s based out of San Antonio, since that is also virtual. Take advantage of this while you can- virtual classes are only a limited time offering! Interested in using data to deliver actionable insights and make informed decisions? Learn more about launching a career in data science here.\nWatch out, Houston! Now you’ll be launching rockets and careers! We’re very excited to now be operating in three cities, and equally excited that anyone across Texas can take advantage of it! Want to see what we’re all about? Attend one of our free virtual events!\n\n","9":"Bryan Walsh, Codeup Web Development alum, and Misty Garcia, a Codeup Data Science alum, joined Sarah Mellor, Director of Marketing & Admissions, and Stephen Salas, VP of Business Development, in a virtual Zoom event to offer you their insights into building a career in tech. If you’re interested in becoming a Lead Software Developer for a government contractor, like Bryan, or having Misty’s title of Data Management Analyst for a healthcare tech company, keep reading (and watching!) to see how they made that possible.\nWhat were you doing before Codeup?\nBoth panelists were established in their positions before finding Codeup. Misty had been an electrical engineer for 11 years, while Bryan worked in hospitality for 14 years. Both hungry for a change, Bryan found San Antonio before finding Codeup. While answering customer questions about why an application wasn’t working the way it should, Bryan wanted to fix the problems, so he figured out a way to make that his job. Misty, however, first found data science before finding Codeup. Below, Misty discusses what stood out to her about Codeup.\n\nhttps:\/\/codeup.com\/wp-content\/uploads\/2020\/08\/Before-Codeup.mp4\n \nWhat if you’re torn between data science and web development?\nBoth panelists knew exactly which program they wanted to apply for prior to even finding Codeup, but that isn’t always the case. So, if you’re torn, there are a number of things we’ll help you think about. What are your interests? What is your background in? What are you expected to know before applying vs. before starting? What is your desired timeline? It will really help to talk this out with your admissions manager rather than on your own because you share a common goal, which is for you to succeed in the best program for you.\nhttps:\/\/codeup.com\/wp-content\/uploads\/2020\/08\/Web-dev-vs-Data-science.mp4\n \nThere are always new things to learn in tech. How have you learned new skills and new programming languages on the job?\nThe most important thing you’ll learn at Codeup is how to learn. We can give you a solid foundation in skills like Python or Java, and you’ll learn very quickly. But technology is always changing, and much more important than any singule particular skill is the ability to learn. Here, Bryan hits on how Codeup prepared him to learn new skills that they weren’t explicitly taught in Codeup, but needed on the job.\nhttps:\/\/codeup.com\/wp-content\/uploads\/2020\/08\/NEw-skills.mp4\n \nHow did we help with your job search while in the program?\nIn addition to our curriculum, we also train you on professional development. In the midst of changing career paths so quickly, it can be easy to doubt yourself, or to not know the industry standards and expectations regarding the job search. To help you out, each student is coached professionally, in the ways that Bryan mentions here.\nhttps:\/\/codeup.com\/wp-content\/uploads\/2020\/08\/job-search.mp4\n \nWhat if you graduated but hadn’t yet gotten a job offer?\nIn addition to professional development, we also offer job placement assistance. Not only will we help you develop the skills you need to land a job, but our Placement team goes above and beyond to actually make sure you get a job, and that by no means stops after you graduate. Misty didn’t graduate with a job lined up, but still worked closely with the Placement team until she had one.\nhttps:\/\/codeup.com\/wp-content\/uploads\/2020\/08\/no-job-offer.mp4\n \nWhat would you say to someone second-guessing this career move?\nThe field of technology is always going to change. You’ll always have to learn new things and you might start to feel like you can’t do it. But Bryan says you just gotta push through. Misty has similar advice, below. Additionally, if you feel like tech is something you can’t do, still apply for Codeup and as you move through the admissions process, allow us to work with you from where you’re at in order to get you to where you need to be. That’s what we’re here for!\nhttps:\/\/codeup.com\/wp-content\/uploads\/2020\/08\/second-guess.mp4\n \nWhile building a career in tech, what sets the successful students apart?\nBe willing! Be willing to be vulnerable, willing to admit what you don’t know, willing to work together, willing to ask for help when you need it. Instructors and admissions staff can’t help you if we don’t know that you need it. But so long as you seek out guidance, even if it means going outside of your comfort zone, we’ll make sure you succeed!\nhttps:\/\/codeup.com\/wp-content\/uploads\/2020\/08\/successful-students.mp4\n \nAnd that’s how to build a career in tech! Desire the change, believe in your capacity to do it, follow through with a willingness to learn, and soon enough, you’ll move from entry-level developer to Lead Developer, or from job seeker to helping a company build their first data science team. \nCodeup is always ready and wanting to help along the way, it just starts with your application!\n \n\n","10":"Three of our Web Development alumni from Dallas, Rex Sutton, Ry Sutton, and Ronnel Palencia, worked with the Dallas Office of Innovation to build and deploy a full-stack application for its COVID-19 Data Challenge! To check out this beautiful project, click here. In July 2020, Rex, Ry, and Ron were part of the first class to graduate from Codeup’s Dallas campus. This application went live in mid September 2020, and the challenge ended in October 2020.\nThe COVID-19 Data Challenge is a competition for students in grades 6 through 12 to use their analytical and\/or coding skills using real COVID data sets. The students attempt to deliver real insights into how COVID is impacting local youth in Dallas.\n“This partnership between the City of Dallas, Dallas County, DISD and other organizations invites students to join the international role that data is playing to fight back against the novel coronavirus Covid-19. By participating in the challenge, students will be able to better understand the virus themselves and share their learnings with their peers to build awareness.” – Office of Innovation, Dallas, TX\nUsing web development skills to get kids involved in data? What an admirable project by our alumni! There are many Data Challenges, Datathons, and Hackathons happening all the time, with many different themes, for many different audiences! If you’re interested in competing in one, Google it to see what interests you! If you’d one day like to create the platform for one, apply for our Web Development program here!\n\n","11":"Setting Expectations for Life Before, During, and After Codeup\nHave you been wondering about whether or not you can keep your current job during Codeup, or if Codeup classes will let you work around certain hours of certain days, or if you really have to apply so far in advance? We get questions like this all the time from prospective students. To make sure you’re successful in your career transition, let’s first set up some expectations about what you can expect before, during, and after Codeup.\n \nBefore Codeup\n\n \nDo the Prework\nThe number one, most important, most helpful advice we can give is: do the prework! Give yourself a month to carefully understand and complete the prework we assign when you’re accepted, which was made to help you practice active learning and problem-solving. You’ll soon find that programming is all about practice and getting that muscle memory, like learning to play an instrument. You will thank yourself if you finish it, and risk falling behind if you don’t.\nApply Early\nIn order to complete the prework, you’ll need to apply early. Why? Take the start date you are considering, and subtract a month. You’ll need to be accepted by that date in order to finish the prework. The multi-step application process can take several weeks to over a month. Combining the prework timeframe plus the application timeframe means you should apply seven weeks before your start date. This will also give you enough time to secure grant funding, if applicable, as that also takes about a month to be processed. You can learn more about our application process here. \n\nDuring Codeup\n\n \nUnderstand Your New Schedule\nCodeup classes are full-time, immersive experiences. As a Codeup student, these are the times you will need to be in class:\n\n\nMonday-Friday: 9am-5pm*^\n*Early release every Monday OR Tuesday: 9am-4pm\n^Half-day every Wednesday: 9am-12:30pm\n\n \nClasses are being conducted daily via live Zoom calls with instructors and other classmates. Optional office hours are held before and after class for additional help. You should plan to spend 20-25 additional hours per week practicing what you learned in class. You should also arrive at your workstation with coffee in tow 30 minutes before class starts so that you can map out your schedule for the day, and review what questions you have going into lecture. Combining office hours, planning, and practicing, you can expect to be occupied from 8am to 7 or 8pm almost daily.\n\n \nLimit Outside Distractions As Much As Possible\nNow that you know your new schedule, you can probably see that you won’t have time for much else. Just for a few months, you’ll have to do the bare minimum outside of Codeup. \nYou will need to quit your job. Before joining Codeup, try to save enough money to pay your bills for 5 months. We strongly suggest you avoid working outside of class, as this typically results in poor classroom performance, and we really want you to do well. If you have to work, calculate the bare minimum you need to earn each week in order to get by. Then, spread out your workload to do a little bit here and there throughout the week rather than full days on the weekends, because you do need rest days! The best options are flexible jobs where you’re in charge of your own schedule, such as food delivery, rideshare, dog walking, babysitting, etc. This is not the time to take an overnight shift at your current job or start your own business.\nYou may need to downgrade your living situation to save up. Some students have sold their houses to make this investment possible. Some have moved in with in-laws to save on bills. Some have had to find roommates. Do whatever you can, within reason, to not have to work during Codeup!\nYou won’t be able to adopt puppies, but you can get a fish, try raising plants, or look at pictures of puppies until you can get the real thing after you graduate! The last option is great because you’ll have a reward to work towards, but you have to earn it!\nOutside classes are also a no-go, but you can watch YouTube videos and documentaries on a new subject you’re interested in. \nFamily and friends may not get to see you as much, but every weekend you can tell them all about what you’re learning and appreciate the time together that much more!\nRemember, it’s only 5 months of complete dedication to changing your life, and then you’ll be thanking yourself for the sacrifices you made!\n\nTake Notes the Right Way \nGone are the days of copying lecture notes word-for-word. (Did that ever work, anyway?) Since you’ll have an online curriculum to read through and refer back to, write notes on what you don’t understand during reading, practice, or lecture. It’s good to track what exactly doesn’t make sense and what you’ve tried that didn’t work so you can ask more targeted questions, whether to peers, Google, or instructors. This way, you’re building yourself a roadmap to follow when you return to your studies each day.\n\nStudy = Practice\nLearning how to code is like learning an instrument. Practice, practice, practice. You can do all the reading you want, watch all the video tutorials, and still not know how to code if you don’t actually code. There’s no cramming for exams, no writing research papers. It’s continuous learning and adding to your arsenal through a few additional hours of study\/practice every day.\n\nNetwork\nIn order to make the most of your experience, build on skills, and help yourself for the job search in the long run, you’ll be encouraged to attend meetups, join community Slack channels, and try to meet others in the industry to build your support network, so you have plenty of people to ask for help. You don’t have to go through this alone!\n\n \nAfter Codeup\n\n \nGit Push Everyday \nWhile this sounds totally foreign right now, it will become a daily mantra! Every Codeup student will make an account on a website called GitHub. On a daily basis, we’ll expect you to “commit” code, which means to make a revision to a code file, and then “push” that revision, which, in this case, means to transfer it from your computer to GitHub so that others can keep track of how often you’re coding. This is important to keep up after graduating Codeup to keep your coding skills fresh, and so that potential employers can see that you’re actively working on your craft.\n\nKeep Learning\nEvery day between graduation and the start of your job, you should become more valuable and skilled, not less polished and more rusty. The learning never stops, especially not in tech, and especially not in data science! What’s all the rage one year may be out of date the next, and it’s your responsibility to stay on top of the latest technology, programming languages, and practices.\n\nYour Job Search is Your New Full-Time Job\nWe have a whole team dedicated to helping students get jobs! Our placement team will assist you even after graduating. You’ll spend time every day on either finding new listings, touching up your resume and LinkedIn, applying, or interviewing…and that’s in addition to coding every day. You gotta put in the work to find work. Do be prepared to get rejected sometimes, but trust the process. It’s much better to face these mass unemployment rates with a whole team working to get you hired rather than on your own.\nIn summary, you get out what you put in. Our most successful students finished their pre work and made significant life sacrifices to stay focused and committed to the program. Others that weren’t ready, willing, or able to make the changes they needed were unfortunately not able to finish. However, those that do continue to reap the rewards! If you would like to hear more about the life of a Codeup student, don’t hesitate to give us a call at 210 – 802 – 7289 to talk to a member of our admissions team today!\n\n","12":"We held a virtual event called “How to Succeed in a Coding Bootcamp” featuring our Dallas-based Full-Stack Web Development instructors, Douglas Hirsh and Fernando Mendoza. To start our incoming students off on the right foot, we wanted to hear what advice they have to optimize a coding bootcamp experience. Check out their top tips below!\nPractice\n“Practical information and practical skills are going to be acquired by practicing every single day.” – Fernando\nPractice is an essential part of learning something new. You could watch people bake all day long, and still not be any better of a baker yourself. That’s why our students spend more time actually writing code than listening to lectures. You’ll practice alone, with your cohort, and with instructor guidance. Through this practice, you will change the way you think and approach problems. The instructors agreed that practicing on your own through fun side projects, like creating a program to organize your baking recipes, sets the most successful students apart from the rest.\n \nConsistency\n“The reason Codeup is every weekday from 9-5 is because we need you to be fully invested. If you only coded on weekends or in your free time, you would forget everything you saw last time and wouldn’t be able to build upon what you know.” – Fernando\nDon’t just practice. Practice consistently. Many of our students have tried the self-taught route and eventually ended up at Codeup. Why? Practicing every now and then doesn’t cut it when it comes to something as complex as programming, the same way practicing every now and then isn’t how you learn a language or an instrument. The way to succeed at something is by practicing it frequently and consistently. Codeup is fully immersive for that very purpose.\n \nPrepare yourself\n“The best thing you can do is the prework that we assign.” – Douglas\nHelp your future self by doing the prework assigned before the first day of class.. This isn’t just busy work. It’s for you and only you. We won’t take a grade on it, it’s really, entirely, to set yourself up for success. We will move incredibly fast and it will feel like drinking from a firehose, even if you did do the prework. Do future you a big favor by getting used to what drinking from a firehose feels like!\n \nProblem solve\n“Replace frustration with curiosity, then experimentation.” – Fernando\nAs you consistently practice the prework, you will come across errors. Instead of getting frustrated, let the errors trigger your curiosity of “why isn’t that working?” and “how do I get it to work?” You can google the keywords in the error message and figure out what to do. This gives you practice problem solving on your own instead of immediately asking someone else for help. While we love helping our students, we will expect you to have already tried to figure things out because we believe in your ability to problem solve. When you do need help, this process helps you frame your questions. We won’t give you answers, but we will happily point to a different way of thinking about an error. It will make getting it right that much more satisfying.\n \nActive learning\n“We want you to be in the mindset of understanding and not discovery. The prework is what takes you there.”- Fernando\nProblem solving your way through the prework allows you to be an active participant in your own learning. You’re giving yourself exposure to a topic before class so that during the lecture, you’re not discovering something new, but trying to understand it. You might not get it the first time you see it, but now you know what to look out for in the lecture.\n \nFailure is temporary\n“Think about where you were 5 weeks ago. Use evidence over time that things have gotten better rather than dwelling on failure in the moment. Failure is learning. Failure is good.” – Douglas\nAs you progress through the program, you will face obstacles and failures, and you will doubt yourself as a programmer. When you feel like you can’t do something, compare yourself to who you were and what you could do 5 weeks ago, instead of comparing yourself to “real programmers.” After reminding yourself of your progress, think about what obstacles are keeping you from moving forward and how to overcome them, instead of defaulting to “I can’t.” Kevin Kelley once said, “Pros are just amateurs who know how to gracefully recover from their mistakes.”\n\nLearn to communicate\n“We have you do group projects and paired programming projects and you get a lot of really good experience working with people remotely. It’s a really good skill to have.” – Douglas\nProgrammers are not in a room alone all day with 10 screens in front of them. They are frequently communicating with their team, with different teams, and with different clients. You’ll need to know how to storytell and how to present your work and yourself. Throughout the course, you will frequently be working with others and presenting to others. Now that we’ve gone remote, our students are learning to work together from far apart.\n \nHow successful you are in a coding bootcamp starts with you and how much you’re willing to put in. If you’re ready to continue putting in time and effort, check out our events. Our workshops will give you exposure to code, and our panels will let you hear the perspectives of people who made the same career change you’re hoping for. You got this! Together, we’ll help you succeed not only at our coding bootcamp, but in your career.\n\n","13":"Here at Codeup, we believe it’s time to revolutionize hiring. We’re launching a first of its kind Salary Refund Guarantee so that employers can hire our developers with no risk and full confidence.\n \nWhat’s a “No-Risk” Hire?\nCodeup offers a 100% tuition refund guarantee to our students: get a job offer in-field within 6 months of graduating or we’ll refund your tuition. We’re proud of how that promise prioritizes student outcomes and holds us accountable to our core value to Deliver Excellence. But students are just one side of a two sided partnership. The ultimate customers are our employer partners that hire our grads. We love our partners – companies like USAA, Accenture, Booz Allen Hamilton, SWBC, and Social Solutions to name a few. And while we’ve always stood by our commitment to provide them with top talent, we never codified it in the same way as our tuition refund guarantee. \nThat’s why we’re excited to announce our newly minted Salary Refund Guarantee: if you hire a Codeup grad and let them go within their first two weeks, we’ll reimburse 100% of their payroll. THAT is a no-risk hire. We believe in our students and our process, and we’re ready to put our money where our mouth is. \n \n$0 in placement fees + 2 week salary refund guarantee = no-risk hire\nLet us de-risk the hiring process for you with a one-of-a-kind hiring Lemon Law. We have no recruitment fees, no placement fees, and we guarantee our grads with two weeks of insured pay. With a diverse pool of over 700 alumni composed of 30% military veterans, 25% women, and 50% minorities, we can curate a list of candidates that will meet your needs.\n \nLove your next software developer, or get their salary back.\nWant to revolutionize your hiring process? Contact our Placement team to learn how we can eliminate your risk and build your team.\n\n","14":"Alumni Katy Salts and Brandi Reger joined us at a public panel event to discuss their Transition into Data Science! Keep reading to hear what stands out to them about Codeup, how Codeup helped them launch a career in data science, and what they are up to now.\nThe Panelists\nKaty Salts graduated from Codeup’s first Data Science cohort back in June of 2019. She has since started working as a Data Scientist at Cyber Fortress, where she has been for about a year. Prior to joining Codeup, Katy studied and worked in biology. \nBrandi Reger graduated from Codeup in July of 2020 with our third Data Science cohort. She has since been hired as a Data Engineer at HEB. Prior to joining Codeup, Brandi had just gotten a degree in Geology in pursuit of becoming an Archeologist after serving in the Army for 5 years. She minored in Statistics, which she wanted to pursue further after realizing archeology wasn’t for her.\nWhy did you choose Codeup over other routes?\n“I didn’t have the ability to take off work and pursue a Masters Degree for 2 years or an undergrad degree for 4 years, and this was the perfect crash course. Also the cost is a lot cheaper than graduate programs and I got a lot of help with grants and scholarships.” – Katy\nWhat sets Codeup’s curriculum apart?\n“It’s very applied. You put what you learn into use and you learn why you learned it that way. In collegiate, you’ll take a test but it’s not quite the same thing as getting your hands dirty and figuring it out. Your mind can drift during lecture and you don’t really “get” it until you do a project. But since you’re doing a project on almost every topic at Codeup, that really solidified the topics we were learning for me.” – Brandi\nHow much programming did you know coming into Codeup?\n“I could not name one programming language. I didn’t know anything. The prework was the first time I wrote a line of code. With Codeup, they will start you from the very beginning of learning programming, it’s just fast-paced.” – Katy\nHow did you address fears or doubt about whether or not you can do it?\n“Just get your hands dirty and do it! Once you’re working on it, it turns out it’s not as bad or as hard as you thought it was. Because you don’t know it, it seems like this amazing, glorious thing in the sky but when you actually work on it you’re like ‘oh, it was just that, that’s no big deal.’ All you have to do is try and apply yourself and you’ll figure it out.” – Brandi\nWhat was one of your favorite lessons?\n“The first project we had, our instructor had to go away for the weekend so we couldn’t contact her. The whole class collectively could not come up with an answer to the problem. We were freaking out thinking like ‘We did something wrong. Why can we not figure it out? She left us!’ We were so scared. When she came back she said ‘you learned a really important lesson, and that’s that sometimes there is no answer to the question. You just need to be able to look at the data and take it for what it is.’ You can’t make things up based on the data you find. You have to come up with real conclusions. That one hit me pretty hard and I never forgot it.” – Katy\nWhat advice would you give to someone in the admissions process?\n“The prework is the best thing you can do for yourself coming into the program. We didn’t go in knowing everything and memorizing it all, and they didn’t expect us to either. You just have to know basic concepts. Like understand that there’s a way to do something and maybe not necessarily know how yet but know that there’s a way. So just being exposed to it ahead of time is helpful.” – Katy\nBrandi, you had the unique experience of being in-person and virtual. What was that like?\n“I really liked being remote. Being in class, it was distracting. My classmates, we were best friends basically while we were going through the program. So we were constantly chatting and everything. But once it was remote it was all quiet. There was nobody distracting me, and I could focus on what I was doing.We could still chat when I wanted to but I could turn off chat when I needed to. Also when the teachers were talking, I had my dual monitors, so I was able to look up what they were talking about and it really solidified what I was learning. So, I got a lot out of it.” – Brandi\nHow was your experience with our student placement team?\n“They are not messing around! I mean, they start early and they leave no stone unturned! They come in and they’re completely revamping your Linkedin, email, photos, what you should and should not post. One-on-one meetings about what you’re looking for in a company and how they can help you get there, what connections they have, who to talk to, who to connect with. How to answer phone calls. Interview questions in class, like answering them together, answering them one-on-one. Mock interviews, resume building. Beginning to end, I mean, that alone was worth it to go through Codeup because no other place gives you that much attention on one single student, and everybody got that attention, and everybody got jobs! And that’s because of all the work they put into getting you ready not just technically, but professionally. They will get you there if you just listen to them and don’t fight back, don’t argue. Just do what they’re saying because they’ve done this enough times and they know what works. Just trust them.” – Katy\nWhat does working in the field look like? \n“My job is awesome! I get to work from home. It’s definitely constant learning. I think Codeup really prepared me for that because they didn’t just teach me how to code- they taught me how to learn and how to learn quickly. I carried that into my job and my job taught me not only to code but also to be able to apply that to a business model. Learning doesn’t stop after Codeup.” – Katy\nWhat’s a typical day in the life for you?\n“I just started a couple of weeks ago so right now a day in the life is reading things and trying to figure out what they are. There are multiple data engineering teams so we all get together and talk about the projects we’re working on and new projects coming down the line. Or we’ll talk to the Data Scientists and they’ll tell us how they’re using our products and what they need from us, and we get to see what happens with the data we’re cleaning and putting together. It’s a constant moving forward and checking in with each other. At this job, you use every programming language you learn at Codeup and 10 others that I don’t even know yet. Everything you learn is useful for something. Codeup teaching you how to learn is very useful because there are still a lot of things I need to learn now.” – Brandi\nWhat distinguishes a Data Engineer from a Data Scientist?\n“As a Data Engineer, I clean up the data and put it together in a way that makes sense. We take the data in a nasty, messy state, it’s all over the place, and make it nice and neat so that somebody else can figure something out from it.” – Brandi\nIs there anything that surprised you in terms of what was considered “data science” during your job search?\n “You have to think of data science as a spectrum of things and on that spectrum you can specialize in different areas, like just gathering data, or just cleaning, just modeling, just making presentations or dashboards. A lot of businesses don’t know what they actually need. They’ll say they need one thing but really what they’re asking for is something else. So you need to be able to sort through those and ask clear questions in interviews. That was a tough lesson to learn in the job search.” -Katy\n \nMore personal quotes include Katy saying that this was “the best thing I’ve done” and Brandi saying that the experience “made me a better person.” Thank you both for joining us! At Codeup, we don’t just teach code – we are in the business of empowering life change!\nIf you’re ready to pursue a new, fulfilling career, check out our blog “What Data Science Career is For You?” to continue leaning into this exciting field.\n\n","15":"We have an exciting announcement! We’re launching a new scholarship to build and support the Black community in tech. The Annie Easley scholarship is a $1000 scholarship awarded to every Codeup student who identifies as Black or African-American. Read on to learn about our commitment to diversifying tech, our support of the Black community, and Annie Easley!\nWhy the new scholarship?\n\n \nOur Core Value of Cultivating Inclusive Growth\nWe make an active, ongoing effort to cultivate inclusive growth at Codeup and in the tech field at large. By encouraging diversity in our cohorts, we are contributing to the long-term growth of underrepresented groups in tech when our students join the workforce. We offer need-based Pride, Veteran, Minorities in Tech, and Women in Tech scholarships. While the numbers of female, non-Black minority, and LGBTQIA+ developers are growing, they are still outpacing their Black counterparts. To help support the growth of the Black community in tech, our Annie Easley scholarship is a guaranteed $1,000 to every student who applies for the scholarship and identifies as Black and\/or African-American.\n\n \nRepresentation Matters\nIn 2018, only 2.7% of professional developers identified as Black. In two years, that number grew by less than 1%. In 2020, only 3.6% of professional developers identify as Black, even though the overall population is 13.4% Black. For some context, 70.7% of developers identify as white.\nWhy do we care? The people building technology should represent the people using technology, and we need to do more to make that happen. Empowering underrepresented developers can increase career opportunities, normalize this career path for rising professionals, and yield more inclusive and equitable technology solutions.\n\n \nCodeup recognizes that there are structural barriers to entry into tech due to systemic racism\nThe centuries of racism and the ensuing, long-lasting burdens on the African-American population cannot be undone.  We acknowledge that there are built-in hurdles that Black Americans have to overcome that are based on thoughts and ideals resulting from that racism. What we can do is work to level the playing field by softening the financial barrier to entry into tech. Our hope is that a guaranteed scholarship will help facilitate this and open up opportunities.\n \nWho is Annie Easley?\nAnnie Easley was one of the first Black employees at NACA (now NASA), where she worked as a human-computer, computer engineer, and rocket scientist from 1955-1989. She wrote the code for the computer program that controls the fuel mixture of the Centaur rocket, which went on to successfully launch several space probes and is still being used today. Additionally, her work on energy conversion systems and alternative energy technology was used to develop the batteries used in modern hybrid vehicles. Easley has also co-authored several papers on nuclear power plants and rocket science.\nIn 1977, she went back to school to get a degree in Mathematics while working full-time, where she raised awareness about NASA and inspired many women and minorities to pursue STEM careers. Later in her career, she helped supervisors address discrimination complaints as an Equal Employment Opportunity counselor, and fought for women’s rights. \nModern spaceflight likely wouldn’t be possible without her, and much of what we know about space might still be unknown. Her work has been monumental not only for African-Americans, not only for women, not only for programmers, but for technology as we know it. That is why we’re naming this scholarship and our next Data Science cohort after her.\n \nHave a say in tomorrow’s tech\nThe technology of tomorrow starts today. If you identify as Black or African-American and would like to help build future technology, start a career as a software developer or data scientist! \nClick here to apply for Codeup, and here to apply for the Easley Scholarship.\n \nAND a special shout out to Shawn Erwin for helping to bring this scholarship to life with the art featured on the image above!\n\n","16":"If you’re struggling to see yourself as a data science professional, it may be because the field of data science can be rather broad. While many positions in data science work across the entire data science pipeline, some are more active in a particular area. Codeup prepares you to take any number of career paths throughout this pipeline. To help explain the differences, we’ll discuss where some of our alumni have ended up. Keep reading to see what appeals to you!\n \nData: Plan and Acquire\nFirst up is the data portion of the data science pipeline, where we plan and acquire the data. \nBusiness Analysts like Jesse Ruiz and Jeff Hutchins, as well as People Analytics Specialists like Tim Sotirhos help their companies or departments identify what questions need to be answered, and what data they need to answer those questions. This often involves researching or reviewing existing processes and strategizing how they can be improved. They may work closely with project managers to create an action plan.\n \nInformation: Process and Prepare\n \nThen, in the information portion, we process and prepare the data for future exploration.\nData Analysts like Matthew Zapata aggregate and manage, that is, combine, process, prepare, and store, the data for easy access. They research and improve on data quality and safeguard against data loss or errors. They also explore the data for potential relationships between variables, usefulness, and outliers. Data Analysts may also acquire the data and\/or analyze the data for potential insights, but typically do not build and deploy machine learning models.\n \nKnowledge: Explore and Analyze\n \nIn the knowledge portion, data is analyzed and turned into meaningful statistics\nThis stage is typically combined with Information or Intelligence rather than existing on its own. In a given company, their Data Analysts may both prepare and explore data, or the Machine Learning Engineers will both explore and model the data. Data Scientists, the broadest career in data science, typically will do all three, like Ednalyn De Dios. Unlike other data professionals (unless otherwise trained), Data Scientists can work anywhere along this continuum. \n \nIntelligence: Model\n \nOnce we have that knowledge, we use the intelligence stage to turn it into future predictions with machine learning models.\nWhen the data is ready, Machine Learning Engineers like Michael Moran and Eric Escalante write the algorithms necessary to build, deploy, and continue to improve upon machine learning models. A machine learning model is a file that uses an algorithm to identify patterns and trends from data.\nDecision Science Analysts, like Jeff Roeder, use math, stats, and machine learning models to convert intelligence-driven insights to actionable recommendations. They answer the questions asked by Business Analysts earlier in the timeline to draw conclusions for their company.\n \nAction: Delivery\n \nFinally, the action stage lets us integrate these insights into tests, then continue to monitor and evaluate new data.\nSecurity Data Analysts like Sara Pena need to be able to identify trends from automated models that they or someone else created. They meet with stakeholders to discuss their analysis and help develop tests and prototypes of their recommendations. They then own and execute projects related to continuous improvement of their company’s processes.\n \n\nWhere Do You Fit In?\nIt’s totally possible for YOU to take on any of these job titles! Maybe it’s time to explore these careers even further, especially if one excited you. While Codeup does prepare and train Data Scientists, you may find your niche and prefer one stage to another. Whatever you choose, Codeup will help you land the job you want not only with our expert, employer-driven curriculum but also with professional help and placement services. Click here to learn how we help you land a job you love.\n\n","17":"Everyone starts somewhere. Many developers out there didn’t grow up wanting to code. It’s something they fell into over time, much like two Codeup alumni, Bridget Mills and Eddy Bautista. These two software developers graduated from our Web Development class in December 2019. They came back for a virtual panel event to share their journey into web development and to give advice to people wanting to become a software developer.\n \nWhat were you doing before Codeup?\nEddy had been a sales assistant for years and was a student at San Antonio College studying Kinesiology.\nBridget worked at a courthouse, but those career plans were altered after becoming a military spouse and moving. She went back to school for a degree in Information Technology (IT), specializing in System Engineering, and became an IT Specialist.\n \nWhat led you to a career in coding?\nWhen someone he knew mentioned coding, Eddy learned all he could and coded for three days using online courses and tutorials. He immediately knew this was what he wanted to do as a career. \nWhile Bridget was working at the lawyer’s office, a development team came in to help with court systems. She asked them questions and became fascinated by what they were doing. After deciding not to pursue law, she decided to go back to school for IT. Her job as an IT Specialist isn’t exactly what she had in mind, but her degree didn’t offer the coding experience necessary to become a developer, which was her true end goal. Even after moving to Hawaii and having two kids, that dream persisted. Her cousin, a developer, mentioned that some of her coworkers went to a coding bootcamp. With another kid and another move on the horizon, she decided she would enroll in a coding bootcamp when her family settled down in Texas. \n \nWhy Codeup?\nWhile researching how to become a developer, Eddy found Codeup. Our culture stood out to him, the admissions team was helpful, he liked that we offer help with the job search through resume assistance and interview training, and he really liked how plugged in we are to the San Antonio technology scene. He felt all the pieces coming together and could picture himself here.\nFor Bridget, it boiled down to the curriculum and hands-on experience. When she was in college, she learned a lot of theory, but didn’t get experience actually coding, which, as she learned the hard way, is what employers are really looking for. She looked into some options for coding bootcamps and Codeup stood out to her. It was big plus that even as a military spouse, she was able to use VA benefits. She loved our assistance with job placement, and noted that she had gone to school twice and neither college offered anything like that. \n \nWhat’s a typical day for you?\nCurrently, both panelists are working as developers for VIA Metropolitan Transit. Due to COVID-19, they’re both working from home.\nEddy usually starts his day early with a coding challenge on a website like Codewars. He has a virtual meeting with his mentor to discuss some code. For most of the day, they solve a problem or do some pair programming. They also have team meetings and daily standups.\nBridget is currently leading an Artificial Intelligence project with VIA that takes up most of her time. She usually has virtual meetings with members of her team, other teams at VIA, and contractors. She does documentation and uses programs to update the current status of her projects for the team to see. \n \nHow is the work-life balance?\nCoding is a hobby for Bridget. She takes her laptop with her from room to room, sometimes coding with her child in her lap. She loves it so much, she often works late unintentionally until her kids come in the room to check on her. Because of this, she doesn’t feel completely balanced but knows that it’s only because she loves it so much.\nEddy feels similarly, stating that when they do work late, it’s usually because they want to. The work-life balance has been good for him.\n \nWhat advice would you give to someone thinking of attending Codeup’s Web Development program?\nBridget was nervous coming into Codeup, but it gave her everything she was looking for. Part of why she wanted to be a developer was because she thought they get to sit around alone, not having to interact with anybody. She very quickly realized this was not the case. “You have to speak up and you have to do it well, and often, with a lot of people. You’ll have to work hard, beyond the regular hours. Take advantage of all the resources. Schedule some meetups with peers to work together outside of class. It’s so worth it in the end. Just go for it!”\nEddy learned that keeping a part-time job is possible but really, really hard. He was one of the only students ever to finish Codeup while working a job, rushing to work right after class. He regrets doing that because he missed out on socializing and working together after hours. But when he had time, he always tried to work with other students to solve problems together, and encourages the same in others. “Break out of your comfort zone and don’t be scared to just start from where you are. The first couple weeks will be really hard, but learn to fall in love with the feeling of being stuck, because eventually you’ll be able to solve it.”\nBridget and Eddy are working together at VIA, but took very different pathways to get to where they are. Eddy hadn’t thought much about coding before deciding to dive right into it, whereas Bridget wanted a career as a developer for years. Whether coding is something you never gave much thought to or you’ve tried a different route before, you, too, can make a transition into web development with Codeup! If you’re interested in starting a career that you love in an ever-growing industry, apply today! \n\n","18":"Butterflies in my belly; my stomach is tied up in knots. I know I’m taking a risk by sharing my story, but I wanted to reach out to others aspiring to be a data scientist. I am writing this with hopes that my story will encourage and motivate you. \n____________________________________________________________________________________________________________________________________\nI don’t have a PhD. Heck, I don’t have any degree. Still, I am very fortunate to work as a data scientist in a ridiculously good company. Here’s how I did it (with a lot of help).\n \nFormative Years\nIt was 1995 and I had just gotten my very first computer. It was a 1982 Apple IIe. It didn’t come with any software but it came with a manual. That’s how I learned my very first computer language: Apple BASIC.\nMy love for programming was born.\nIn Algebra class, I remember learning about the quadratic equation. I had a cheap graphic calculator then, a Casio, that’s about half the price of a TI-82. It came with a manual too, so I decided to write a program that will solve the quadratic equation for me without much hassle.\nMy love for solving problems was born.\nIn my senior year, my parents didn’t know anything about financial aid but I was determined to go to college so I decided to join the Navy so that I could use Montgomery GI Bill to pay for my college. After all, four years of service didn’t seem that long.\nMy love for adventure was born.\nLater in my career in the Navy, I was promoted as the ship’s financial manager. I was in charge of managing multiple budgets. The experience taught me bookkeeping.\nMy love for numbers was born.\nAfter the Navy, I ended up volunteering for a non-profit. They eventually recruited me to start a domestic violence crisis program from scratch. I had no social work experience but I agreed anyway.\nMy love for saying “Why not?” was born.\n \nRock Bottom\nAfter a few successful years, my boss retired and the new boss fired me. I was devastated. I fell into a deep state of clinical depression and I felt worthless.\nI recall crying very loudly at the kitchen table. It had been more than a year since my non-profit job and I was nowhere near close to having a prospect for the next one. I was in a very dark space.\nThankfully, the crying fit was a cathartic experience. It gave me a jolt to do some introspection, stop whining, and come up with a plan.\n“Choose a Job You Love, and You Will Never Have To Work a Day in Your Life.” — Anonymous\n \nFalling in Love, All Over Again\nTo pay the bills, I was working as a freelance web designer\/developer but I wasn’t happy. Frankly, the business of doing web design bored me. It was frustrating working with clients who think and act like they’re the expert on design.\nSo I started thinking, “what’s next?”\nSearching the web, I stumbled upon the latest news in artificial intelligence. It led me to machine learning which in turn led me to the subject of data science.\nI signed up for Andrew Ng’s machine learning course on Coursera. I listened to TwitML, Linear Digression, and a few other podcasts. I revisited Python and got reacquainted with git on Github.\nMy love for data science was born.\nIt was at this time that I made the conscious decision to be a data scientist.\n \nLeap of Faith\nLearning something new was fun for me. But still, I had that voice in my head telling me that no matter how much I study and learn, I will never get a job because I don’t have a degree.\nSo, I took a hard look in the mirror and acknowledged that I needed help. But I wasn’t sure where to look.\nThen one day out of the blue, my girlfriend asked me what data science is. I jumped off my feet and started explaining right away. Once I stopped explaining to catch a breath, I managed to ask her why she asked. And that’s when she told me that she’d seen a sign on a billboard. We went for a drive and I saw the sign for myself. It was a curious billboard with two big words “data science” and a smaller one that says “Codeup.” I went to their website and researched their employment outcomes.\nI was sold.\n \nPreparation\nBefore the start of the class, we were given a list of materials to go over.\n\nData Science Math Skills — Coursera\nMathematics for Machine Learning: Linear Algebra — Coursera\nBasic Statistics — Coursera\nPython for Data Science — Coursera\nExcel Basics — Udemy\nLearning the Command Line — Codecademy\n\nGiven that I had only about two months to prepare, I was not expected to finish the courses. But, I did them anyway. I spent day and night going over the courses and materials, did the tests, and got the certificates!\n \nBootcamp\nCodeup was a blur. We had a saying in the Navy about the bootcamp experience: “the days drag on but the weeks fly by.” This was definitely true for the Codeup bootcamp as well.\nWe were coding in Python, querying the SQL database, and making dashboards in Tableau. We did projects after projects. We learned about different methodologies like regression, classification, clustering, time-series, anomaly detection, natural language processing, and distributed machine learning.\nMore important than the specific tools, I learned: \n\nReal data is messy; deal with it.\nIf you can’t communicate with your stakeholders, you’re useless.\nDocument your code.\nRead the documentation.\nAlways be learning.\n\n \nJob Hunting\nOur job hunting process started from day one. We updated our LinkedIn profile and made sure that we were pushing to Github almost every day. I even spruced up my personal website to include the projects we did during class. And of course, we made sure that our resumé was in good shape.\nCodeup helped me with all of these.\nIn addition, Codeup also helped prepare me for both technical and behavioral interviews. The student placement team taught me how to optimize answers to highlight my strengths as a high-potential candidate.\n \nPost-Graduation\nMy education continued even after graduation. In between filling out applications, I wrote code every day and tried out different Python libraries. I regularly read the news for the latest developments in machine learning. While doing chores, I would listen to a podcast, a TedTalk, or a LinkedIn learning video. When bored, I listened to or read books about data or professional development.\nI’ve had a lot of rejections. The first one was the hardest but after that, it kept getting easier. I developed a thick skin and learned to keep moving.\n \nConclusion\nIt took me 3 months after graduating from Codeup to get a job. When I got the job offer, I felt very grateful, relieved, and excited.\nI could not have done it without Codeup and my family’s support.\n____________________________________________________________________________________________________________________________________\nThis blog post was written by Ednalyn C. De Dios for Towards Data Science: A Medium publication sharing concepts, ideas, and codes. An edited version is being shared on Codeup with permission from the author. You can reach them on Twitter or LinkedIn.\n____________________________________________________________________________________________________________________________________\nIf you’d like to learn more about how Codeup can help you launch your career in data science, schedule a call with our team today or reach out to admissions@codeup.com!\n\n","19":"If you’ve been digging around our website or researching tech tools, you may have heard of Python. Python is a programming language that can be used by software developers, accountants, mathematicians, and especially, data scientists. Python is actually the dominant programming language in data science, often used for data wrangling, analysis, visualization, and machine learning.\nWhat is Python Used For?\nPython is an object-oriented language, meaning that the focus is on data and procedures rather than functions and logic. By writing out procedures, you can actually modify the data you have. It can help you automate mundane, repetitive tasks, such as downloading websites, changing the format of those websites, renaming those files, and uploading them to servers. With Python, you can program all of these tasks to be done automatically every time you download a website. This automation saves data scientists a lot of time. \nIs it Good for Beginners?\nYes! One of the key features of Python is the short, easy to understand syntax in which you write your code. Its minimalistic nature allows you to focus on solving your problem rather than solving the code itself. It reads and feels more like English as compared to other common programming languages. Sometimes, what would take you 4 lines of code in Java can be done with 1 line of code in Python. Because it is a high-level language, meaning it is largely independent of your computer specifications, you can get started using Python on whatever device you have – even phones, tablets, or PlayStation!\nHow is it Used in Data Science?\nPython can be used for data wrangling, data analysis, data visualizations, and applying machine learning algorithms. Data wrangling involves preparing raw data for use by parsing it, meaning to convert each data point to a standard format, and by cleaning it, which means to separate useful data from erroneous or missing data points. This is relatively easy if you have only a few data points, but parsing Big Data by hand, like a thousands-of-terabytes large list of every transaction a retail store has ever had, is out of the question. So, Python is used to automate these tasks. It’s also used for data analysis – helping you find trends, correlations, variations, and outliers; data visualizations – helping you chart or graph your findings to show to others; and machine learning, as the complex algorithms and workflows that it’s capable of make it great for Artificial Intelligence.\nWhile this all sounds quite complex, remember, every data scientist started out knowing nothing about Python. Want to try it out? Check out our events page to see when our next free, beginner-friendly, Python Workshop is! If you don’t see one listed, check again soon – we usually have one every other month. \n\n"}}